.config/emacs/TANGLE.org
:PROPERTIES:
:author: Ricardo Gomez
:email:  rgomezgerardi@gmail.com
:title:  Emacs Custom Configuration 
:header-args+: :tangle init.el
:header-args+: :tangle-mode (identity #o755)
:header-args+: :noweb strip-export
:header-args+: :cache yes
:END:

* Order
Order of blocks that must be tangle before the rest.

#+begin_src emacs-lisp :tangle early-init.el
<<library>>

<<straight>>

<<use-package>>

<<gcmh>>

<<exec-path-from-shell>>

<<no-littering>>

<<general>>

<<doom-themes>>
#+end_src

* Editing
Basic text editing facilities.

#+begin_src emacs-lisp :tangle no
 help
#+end_src

** COMMENT Editing Basics
Most basic editing facilities.

#+begin_src emacs-lisp
(setq-default tab-width 4)  ; Distance between tab stops, in columns
#+end_src

** Electricity
Electric behavior for self inserting keys.


*** COMMENT Electric

#+begin_src emacs-lisp
(use-package electric :straight (:type built-in)
  :demand
  :custom
  (electric-indent-inhibit t)
  (electric-indent-chars '(?\n ?\^?))
  :config
  (electric-indent-mode 0)
  (electric-layout-mode 0))
#+end_src

*** Pair

#+begin_src emacs-lisp
(use-package elec-pair :straight (:type built-in)
  :demand
  :custom
  (electric-pair-pairs '((?\" . ?\") (?\{ . ?\})))
  :config
  (electric-pair-mode 1))
#+end_src

** COMMENT Smartparens
A minor mode for dealing with pairs in Emacs.
https://github.com/Fuco1/smartparens

#+begin_src emacs-lisp
(use-package smartparens
  :hook ((prog-mode
		  text-mode
		  conf-mode) . (lambda ()
						 (smartparens-mode 1)
						 (show-smartparens-mode 1)))
  :config ())  ; Show message if verbose is activated
  ;; :config
  ;; (add-hook 'minibuffer-setup-hook 'turn-on-smartparens-strict-mode))
  ;; (smartparens-global-strict-mode 1))
;;sp-ignore-mode-list
#+end_src

** Emulations
Emulations of other editors.

*** Evil
Extensible Vi layer for Emacs.
https://github.com/emacs-evil/evil

#+begin_src emacs-lisp
(use-package evil
  :demand
  :custom
  (evil-respect-visual-line-mode t)
  (evil-shift-width 4)
  (evil-undo-system 'undo-tree)
  (evil-split-window-below t)
  (evil-vsplit-window-right t)
  (evil-want-C-i-jump nil)
  (evil-want-C-u-scroll nil)
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-auto-indent nil)
  (evil-echo-state nil)
  :config
  (evil-mode 1)
  :general
  ('insert
   "C-g" #'evil-normal-state)
  :gfhook
  ; Issue: https://github.com/noctuid/evil-guide#why-dont-keys-defined-with-evil-define-key-work-immediately
  ('after-init-hook #'(lambda (&rest _)
       (when-let ((messages-buffer (get-buffer "*Messages*")))
         (with-current-buffer messages-buffer
           (evil-normalize-keymaps)))) nil nil t))
#+end_src

**** Collection
A set of keybindings for Evil mode
https://github.com/emacs-evil/evil-collection

#+begin_src emacs-lisp
(use-package evil-collection
  :demand
  :after evil
  :custom
  (evil-collection-setup-minibuffer t)
  ;; (evil-collection-outline-bind-tab-p nil)
  :config
  (evil-collection-init))
#+end_src

***** Agenda
Supplemental evil-mode key-bindings to Emacs org-mode.
https://github.com/Somelauw/evil-org-mode

#+begin_src emacs-lisp
(use-package evil-org
  :demand
  :after (evil evil-collection org)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src

**** Comment
Comment/uncomment lines efficiently. Like Nerd Commenter in Vim
https://github.com/redguardtoo/evil-nerd-commenter

#+begin_src emacs-lisp

(use-package evil-nerd-commenter
  :after evil
  :preface
  (defun counsel-imenu-comments ()
	(interactive)
	(let* ((imenu-create-index-function 'evilnc-imenu-create-index-function))
	  (unless (featurep 'counsel) (require 'counsel))
	  (counsel-imenu)))
  :general
  ('motion
   "M-;" 'evilnc-comment-or-uncomment-lines))
#+end_src

**** Surround
https://github.com/emacs-evil/evil-surround

#+begin_src elisp
(use-package evil-surround
  :after evil
  :demand
  :config
  (global-evil-surround-mode 1)
)
#+end_src

**** Goggles 
Displays a visual hint when editing with evil.
https://github.com/edkolev/evil-goggles

#+begin_src emacs-lisp
(use-package evil-goggles
  :demand
  :after evil
  :custom
  (evil-goggles-duration 0.3)
  (evil-goggles-async-duration 0.9)
  :config
  (custom-set-faces
   '(evil-goggles-default-face ((t (:inherit region :background "gray60")))))
  (evil-goggles-mode 1))
#+end_src
   
**** COMMENT Smartparens
Evil smartparens is a minor mode which makes evil play nice with smartparens.
https://github.com/expez/evil-smartparens

#+begin_src emacs-lisp
(use-package evil-smartparens
  :after evil
  ;; :hook
  ;; (electric-pair-mode . #'evil-smartparens-mode)
  ;; :config
  ;; (evil-smart--mode 1)
)
#+end_src

*** Vi Tilde Fringe
Displays tildes in the fringe on empty lines a la Vi.
https://github.com/syl20bnr/vi-tilde-fringe

#+begin_src emacs-lisp
(use-package vi-tilde-fringe
  :hook (prog-mode . vi-tilde-fringe-mode)
; Disable for some modes
  ((treemacs-mode
    dashboard-mode) . (lambda () (vi-tilde-fringe-mode 0)))
  :config ())  ; Show message if verbose is activated
#+end_src

** Fill
Indenting and filling text.

#+begin_src emacs-lisp
;; (setq-default fill-column 120)
;; (setq fill-column 120)
#+end_src

** Visual Line
Editing based on visual line, rather than logical lines.

#+begin_src emacs-lisp
(use-package visual-line :straight (:type built-in)
  :hook ((text-mode outline-mode) . visual-line-mode)
  :custom
  (visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  :config ())  ; Show message if verbose is activated
#+end_src
   
** COMMENT Indent
Indentation commands.

#+begin_src emacs-lisp
(setq-default indent-tabs-mode t)
#+end_src

** COMMENT Killing
Killing and yanking commands.

#+begin_src emacs-lisp
(setq backward-delete-char-untabify-method 'hungry)
#+end_src

** Matching
Various sorts of searching and matching.

*** Isearch
Incremental search minor mode.

#+begin_src emacs-lisp
(use-package isearch :straight (:type built-in)
  :demand
  :general
  (isearch-mode-map
   "M-e" 'consult-isearch                 ;; orig. isearch-edit-string
   "M-s e" 'consult-isearch               ;; orig. isearch-edit-string
   "M-s l" 'consult-line                  ;; needed by consult-line to detect isearch
   "M-s L" 'consult-line-multi)           ;; needed by consult-line to detect isearch
  )
#+end_src

** COMMENT Mouse
Input from the mouse.

#+begin_src emacs-lisp
  ; Zoom In/Out
  (general-def
    "<C-wheel-up>" 'text-scale-increase
    "<C-wheel-down>" 'text-scale-decrease)
#+end_src

** Undo
Undoing changes in buffers.

*** Undo Tree
Treat undo history as a tree
https://gitlab.com/tsc25/undo-tree

#+begin_src emacs-lisp
(use-package undo-tree
  :demand
  :config (global-undo-tree-mode))
#+end_src

** YASnippet
A template system for Emacs.
https://github.com/joaotavora/yasnippet

#+begin_src emacs-lisp
(use-package yasnippet
  ;; :ghook ('(conf-mode-hook prog-mode-hook text-mode-hook) #'yas-minor-mode)
  :demand
  :config 
  (yas-global-mode 1)
)  ; Show message if verbose is activated
#+end_src

*** YASnippet Snippets
Yasnippet official snippet collections
https://github.com/AndreaCrotti/yasnippet-snippets

#+begin_src emacs-lisp
(use-package yasnippet-snippets
  :after yasnippet)
#+end_src

*** Doom Snippets
Doom Emacs' Snippet Library
https://github.com/hlissner/doom-snippets

#+begin_src emacs-lisp
(use-package doom-snippets
  :straight (doom-snippets :type git :host github :repo "hlissner/doom-snippets" :files ("*.el" "*"))
  :after yasnippet)
#+end_src

** COMMENT Tempel
Simple templates for Emacs
https://github.com/minad/tempel

#+begin_src elisp
(use-package tempel
  :demand

  )
#+end_src

** Paren Matching
Highlight (un)matching of parens and expressions.

#+begin_src emacs-lisp
(use-package paren :straight (:type built-in)
  :demand
  :custom
  (show-paren-style 'parenthesis)
  (show-paren-delay 0.125)
  (blink-matching-paren t)
  (blink-matching-delay 1)
  :config
  (show-paren-mode 1))
#+end_src

* Convenience
Convenience features for faster editing.

** COMMENT Abbreviations
Abbreviation handling, typing shortcuts, macros.

** Completion
*** Corfu
Completion Overlay Region FUnction
https://github.com/minad/corfu

#+begin_src emacs-lisp
(use-package corfu
  :demand
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-auto-delay 0)
  (corfu-auto-prefix 2)
  :config
  (corfu-global-mode 1)
  :general
  (corfu-map
   "M-j" #'corfu-next
   "M-k" #'corfu-previous))
#+end_src

**** Cape
Let your completions fly!
https://github.com/minad/cape

#+begin_src emacs-lisp
(use-package cape
  :after corfu
  :demand
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-abbrev)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-dict)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-ispell)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  (add-to-list 'completion-at-point-functions #'cape-line)
  (add-to-list 'completion-at-point-functions #'cape-rfc1345)
  (add-to-list 'completion-at-point-functions #'cape-sgml)
  (add-to-list 'completion-at-point-functions #'cape-symbol)
  (add-to-list 'completion-at-point-functions #'cape-tex)
  :general 
  (leader-def
   "c p" #'completion-at-point ;; capf
   "c a" #'cape-abbrev
   "c d" #'cape-dabbrev        ;; or dabbrev-completion
   "c w" #'cape-dict
   "c f" #'cape-file
   "c i" #'cape-ispell
   "c k" #'cape-keyword
   "c l" #'cape-line
   "c r" #'cape-rfc1345
   "c &" #'cape-sgml
   "c s" #'cape-symbol
   "c t" #'complete-tag        ;; etags
   "c _" #'cape-tex
   "c ^" #'cape-tex
  ))
#+end_src

*** COMMENT Company
Extensible inline text completion framework.
https://github.com/company-mode/company-mode

#+begin_src emacs-lisp
(use-package company
  :demand
  :custom
  (company-minimum-prefix-length 2)
  (company-idle-delay 0)
  :config
  (global-company-mode 1)
  :general
  (company-active-map
   "<tab>" #'company-indent-or-complete-common)
)
#+end_src   

**** COMMENT Company Box
A company front-end with icons.
https://github.com/sebastiencs/company-box/   

#+begin_src emacs-lisp :tangle no
   (use-package company-box
     :after company
     :hook (company-mode . company-box-mode))
#+end_src
 
