.config/emacs/init.el
(use-package elec-pair :straight (:type built-in)
  :demand
  :custom
  (electric-pair-pairs '((?\" . ?\") (?\{ . ?\})))
  :config
  (electric-pair-mode 1))

(use-package evil
  :demand
  :custom
  (evil-respect-visual-line-mode t)
  (evil-shift-width 4)
  (evil-undo-system 'undo-tree)
  (evil-split-window-below t)
  (evil-vsplit-window-right t)
  (evil-want-C-i-jump nil)
  (evil-want-C-u-scroll nil)
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-auto-indent nil)
  (evil-echo-state nil)
  :config
  (evil-mode 1)
  :general
  ('insert
   "C-g" #'evil-normal-state)
  :gfhook
  ; Issue: https://github.com/noctuid/evil-guide#why-dont-keys-defined-with-evil-define-key-work-immediately
  ('after-init-hook #'(lambda (&rest _)
       (when-let ((messages-buffer (get-buffer "*Messages*")))
         (with-current-buffer messages-buffer
           (evil-normalize-keymaps)))) nil nil t))

(use-package evil-collection
  :demand
  :after evil
  :custom
  (evil-collection-setup-minibuffer t)
  ;; (evil-collection-outline-bind-tab-p nil)
  :config
  (evil-collection-init))

(use-package evil-org
  :demand
  :after (evil evil-collection org)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-nerd-commenter
  :after evil
  :preface
  (defun counsel-imenu-comments ()
	(interactive)
	(let* ((imenu-create-index-function 'evilnc-imenu-create-index-function))
	  (unless (featurep 'counsel) (require 'counsel))
	  (counsel-imenu)))
  :general
  ('motion
   "M-;" 'evilnc-comment-or-uncomment-lines))

(use-package evil-surround
  :after evil
  :demand
  :config
  (global-evil-surround-mode 1)
)

(use-package evil-goggles
  :demand
  :after evil
  :custom
  (evil-goggles-duration 0.3)
  (evil-goggles-async-duration 0.9)
  :config
  (custom-set-faces
   '(evil-goggles-default-face ((t (:inherit region :background "gray60")))))
  (evil-goggles-mode 1))

(use-package vi-tilde-fringe
  :hook (prog-mode . vi-tilde-fringe-mode)
; Disable for some modes
  ((treemacs-mode
    dashboard-mode) . (lambda () (vi-tilde-fringe-mode 0)))
  :config ())  ; Show message if verbose is activated

;; (setq-default fill-column 120)
;; (setq fill-column 120)

(use-package visual-line :straight (:type built-in)
  :hook ((text-mode outline-mode) . visual-line-mode)
  :custom
  (visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  :config ())  ; Show message if verbose is activated

(use-package isearch :straight (:type built-in)
  :demand
  :general
  (isearch-mode-map
   "M-e" 'consult-isearch                 ;; orig. isearch-edit-string
   "M-s e" 'consult-isearch               ;; orig. isearch-edit-string
   "M-s l" 'consult-line                  ;; needed by consult-line to detect isearch
   "M-s L" 'consult-line-multi)           ;; needed by consult-line to detect isearch
  )

(use-package undo-tree
  :demand
  :config (global-undo-tree-mode))

(use-package yasnippet
  ;; :ghook ('(conf-mode-hook prog-mode-hook text-mode-hook) #'yas-minor-mode)
  :demand
  :config 
  (yas-global-mode 1)
)  ; Show message if verbose is activated

(use-package yasnippet-snippets
  :after yasnippet)

(use-package doom-snippets
  :straight (doom-snippets :type git :host github :repo "hlissner/doom-snippets" :files ("*.el" "*"))
  :after yasnippet)

(use-package paren :straight (:type built-in)
  :demand
  :custom
  (show-paren-style 'parenthesis)
  (show-paren-delay 0.125)
  (blink-matching-paren t)
  (blink-matching-delay 1)
  :config
  (show-paren-mode 1))

(use-package corfu
  :demand
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-auto-delay 0)
  (corfu-auto-prefix 2)
  :config
  (corfu-global-mode 1)
  :general
  (corfu-map
   "M-j" #'corfu-next
   "M-k" #'corfu-previous))

(use-package cape
  :after corfu
  :demand
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-abbrev)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-dict)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-ispell)
  (add-to-list 'completion-at-point-functions #'cape-keyword)
  (add-to-list 'completion-at-point-functions #'cape-line)
  (add-to-list 'completion-at-point-functions #'cape-rfc1345)
  (add-to-list 'completion-at-point-functions #'cape-sgml)
  (add-to-list 'completion-at-point-functions #'cape-symbol)
  (add-to-list 'completion-at-point-functions #'cape-tex)
  :general 
  (leader-def
   "c p" #'completion-at-point ;; capf
   "c a" #'cape-abbrev
   "c d" #'cape-dabbrev        ;; or dabbrev-completion
   "c w" #'cape-dict
   "c f" #'cape-file
   "c i" #'cape-ispell
   "c k" #'cape-keyword
   "c l" #'cape-line
   "c r" #'cape-rfc1345
   "c &" #'cape-sgml
   "c s" #'cape-symbol
   "c t" #'complete-tag        ;; etags
   "c _" #'cape-tex
   "c ^" #'cape-tex
  ))
