.config/emacs/TANGLE.org
**** COMMENT Company Emoji
Backend providing autocompletion for emoji.
https://github.com/dunn/company-emoji

#+begin_src emacs-lisp :tangle no
(use-package company-emoji
  :demand
  :after company
  :preface
  (defun --set-emoji-font (frame)
	"Adjust the font settings of FRAME so Emacs can display emoji properly."
	(if (eq system-type 'darwin)
		;; For NS/Cocoa
		(set-fontset-font t 'symbol (font-spec :family "Apple Color Emoji") frame 'prepend)
      ;; For Linux
      (set-fontset-font t 'symbol (font-spec :family "Symbola") frame 'prepend)))
  :config
  ;; For when Emacs is started in GUI mode:
  ;; (--set-emoji-font nil)
  ;; Hook for when a frame is created with emacsclient
  ;; see https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Frames.html
  ;; (add-hook 'after-make-frame-functions '--set-emoji-font)
  (add-to-list 'company-backends 'company-emoji))	
#+end_src

** Dabbrev

#+begin_src emacs-lisp
(use-package dabbrev :straight (:type built-in)
  :general
  (general-swap-key nil 'global
    "M-/" "C-M-/"))
#+end_src

** General
Convenience wrappers for keybindings.
https://github.com/noctuid/general.el

#+begin_src emacs-lisp :tangle no :noweb-ref general
(use-package general
  :demand
  :defines texinfo-section-list
  :config
  ;; (general-auto-unbind-keys)  ; Automatic Key Unbinding
  (general-setq auto-revert-interval 10)

  (defconst leader "SPC")
  (general-create-definer leader-def
    :states '(motion normal insert emacs)
    :keymaps 'override
    :prefix leader
    :non-normal-prefix (concat "M-" leader)
    :prefix-command 'leader-prefix-command
    :prefix-map 'leader-prefix-map)
  
  (general-def "<escape>" #'keyboard-escape-quit))
#+end_src

** COMMENT Hydra
Make bindings that stick around.
https://github.com/abo-abo/hydra

#+begin_src emacs-lisp
  (use-package hydra
	:config
	  (defhydra hydra-zoom (:timeout 4)
		"zoom"
		("l" text-scale-increase "in")
		("h" text-scale-decrease "out")
		("f" nil "finished" :exit t))

	  (defhydra hydra-yank-pop ()
		"yank"
		("C-y" yank nil)
		("M-y" yank-pop nil)
		("y" (yank-pop 1) "next")
		("Y" (yank-pop -1) "prev")
		("l" helm-show-kill-ring "list" :color blue))   ; or browse-kill-ring
	:general
	  (leader-def
		"z z" '(hydra-zoom/body :which-key "scale text")
		"M-y" '(hydra-yank-pop/yank-pop :which-key "yank pop")
		"C-y" '(hydra-yank-pop/yank :which-key "yank")))
#+end_src

** Rainbow
Show color strings with a background color.
https://github.com/emacsmirror/rainbow-mode

#+begin_src emacs-lisp
(use-package rainbow-mode
  :preface
  (defun rainbow-turn-off-hexadecimal ()
    "Turn off hexadecimal colours in rainbow-mode."
    (interactive)
    (font-lock-remove-keywords
     nil
     `(,@rainbow-hexadecimal-colors-font-lock-keywords))
    (font-lock-fontify-buffer))

  (defun rainbow-turn-off-words ()
    "Turn off word colours in rainbow-mode."
    (interactive)
    (font-lock-remove-keywords
     nil
     `(,@rainbow-x-colors-font-lock-keywords))
    (font-lock-fontify-buffer))
  :hook ((prog-mode text-mode) . rainbow-mode)
  :config ())  ; Show message if verbose is activated
#+end_src

*** Rainbow Delimiters
Highlight brackets according to their depth
https://github.com/Fanael/rainbow-delimiters

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :config ())  ; Show message if verbose is activated
#+end_src

*** COMMENT Rainbow Identifiers
Highlight identifiers according to their names
https://github.com/Fanael/rainbow-identifiers

#+begin_src emacs-lisp
(use-package rainbow-identifiers
  :hook (prog-mode . rainbow-identifiers-mode)
  :config ())  ; Show message if verbose is activated
#+end_src

** Good Scroll
Attempt at good pixel-based smooth scrolling in Emacs.
https://github.com/io12/good-scroll.el

#+begin_src emacs-lisp
(use-package good-scroll
:demand
:preface
:custom
(good-scroll-step 50)
:config
(good-scroll-mode 1)
:general
("<wheel-up>"   'good-scroll-up
 "<wheel-down>" 'good-scroll-down
 ;; [remap scroll-up-command]          'good-scroll-up
 ;; [remap scroll-down-command]          'good-scroll-down
 [next] #'good-scroll-up-full-screen
 [prior] #'good-scroll-down-full-screen))
#+end_src
   
** Highlight Parentheses
A minor mode to highlight parentheses surrounding point.

#+begin_src emacs-lisp
(use-package highlight-parentheses
  :hook ((prog-mode text-mode) . highlight-parentheses-mode)
  :config ())  ; Show message if verbose is activated
#+end_src

** Highlight Numbers
An Emacs minor mode that highlights numeric literals in source code.
https://github.com/Fanael/highlight-numbers

#+begin_src emacs-lisp
(use-package highlight-numbers
  :hook ((prog-mode text-mode) . highlight-numbers-mode)
  :config ())  ; Show message if verbose is activated
;; '(highlight-numbers-number ((t (:foreground "#f0ad6d"))))
#+end_src

** COMMENT Display Fill Column Indicator
Display a fill column indicator in the buffer.
https://github.com/alpaker/fill-column-indicator

#+begin_src emacs-lisp
(use-package display-fill-column-indicator :straight (:type built-in)
  :hook ((prog-mode text-mode) . display-fill-column-indicator-mode)
  :custom
  (dfci-rule-color "#111122")
  (dfci-rule-use-dashes nil)
  (dfci-rule-width 1)
  (dfci-rule-color "darkblue"))
#+end_src
   
** Beacon
Never lose your cursor again
https://github.com/Malabarba/beacon

#+begin_src emacs-lisp
(use-package beacon
  :demand
  :custom
  (beacon-size 40)
  (beacon-color 0.6)
  ;; (beacon-blink-duration)
  ;; (beacon-blink-delay)
  (beacon-blink-when-window-scrolls t)
  (beacon-blink-when-window-changes t)
  (beacon-blink-when-focused t)
  (beacon-blink-when-point-moves t)
  ;; (beacon-dont-blink-major-modes)
  ;; (beacon-dont-blink-predicates)
  ;; (beacon-dont-blink-commands)
  ;; (beacon-push-mark)
  :config
  ;; Disable it only in specific buffers
  ;; (setq-local beacon-mode nil).
  (beacon-mode 1))
#+end_src

** COMMENT Whitespace
Visualize blanks (TAB, (HARD) SPACE and NEWLINE).

#+begin_src emacs-lisp
(use-package whitespace :straight nil
  :hook (gdscript-mode . whitespace-mode)
  :custom
  (whitespace-display-mappings  ; Specify an alist of mappings for displaying characters
   '((tab-mark 9 [8677 9] [92 9])  ;| 124  ⇥ 8677  ⇨ 8680  ↦ 8614
     (space-mark 32 [183] [46])
     (newline-mark 10 [182 10])))
  (whitespace-style '(tabs tab-mark))  ; Specify which kind of blank is visualized
  ; Tabs tab-mark trailing indentation indentation::tab indentation::space
  :custom-face
  (whitespace-tab ((t (:foreground "#c1c1c1"))))
)
#+end_src

** Tab
** COMMENT Centaur Tabs
Display a tab bar in the header line.
https://github.com/ema2159/centaur-tabs

#+begin_src emacs-lisp
(use-package centaur-tabs
  :demand
  :preface
  (defun centaur-tabs-buffer-groups ()
    "`centaur-tabs-buffer-groups' control buffers' group rules.

Group centaur-tabs with mode if buffer is derived from `eshell-mode'
`emacs-lisp-mode' `dired-mode' `org-mode' `magit-mode'.
All buffer name start with * will group to \"Emacs\".
Other buffer group by `centaur-tabs-get-group-name' with project name."
    (list
      ((string-equal "*" (substring (buffer-name) 0 1)) "Emacs")
      ((derived-mode-p 'eshell-mode) "EShell")
      ((derived-mode-p 'emacs-lisp-mode) "Elisp")
      ((derived-mode-p 'dired-mode) "Dired")
      ((derived-mode-p 'org-agenda) "Agenda")

      ((memq major-mode '(magit-process-mode
			  magit-status-mode
			  magit-diff-mode
			  magit-log-mode
			  magit-file-mode
			  magit-blob-mode
			  magit-blame-mode
			  ))
       "Magit")
      ((memq major-mode '(org-agenda-mode
			  org-agenda-clockreport-mode
			  org-agenda-log-mode
			  diary-mode))
       "Agenda")
      (t
 (defun centaur-tabs-hide-tab (x)
  "Do no to show buffer X in tabs."
  (let ((name (format "%s" x)))
    (or
     ;; Current window is not dedicated window.
     (window-dedicated-p (selected-window))

     ;; Buffer name not match below blacklist.
     (string-prefix-p "*epc" name)
     (string-prefix-p "*helm" name)
     (string-prefix-p "*Helm" name)
     (string-prefix-p "*Compile-Log*" name)
     (string-prefix-p "*lsp" name)
     (string-prefix-p "*company" name)
     (string-prefix-p "*Flycheck" name)
     (string-prefix-p "*tramp" name)
     (string-prefix-p " *Mini" name)
     (string-prefix-p "*help" name)
     (string-prefix-p "*straight" name)
     (string-prefix-p " *temp" name)
     (string-prefix-p "*Help" name)
     (string-prefix-p "*mybuf" name)

     ;; Is not magit buffer.
     (and (string-prefix-p "magit" name)
	  (not (file-name-extension name)))
     )))      (centaur-tabs-get-group-name (current-buffer)))))
  :hook
  ((dired-mode 
    help-mode helpful-mode
    special-mode
    term-mode calendar-mode
    delayed-warning
    debugger-mode
    ibuffer-mode buffer-menu-mode
    messages-buffer-mode
    org-agenda-mode
    dashboard-mode 
    org-src-mode
    ;; org-beamer-mode
    ;; org-indent-mode
    ;; org-bullets-mode
    ;; org-cdlatex-mode
    popup-buffer-mode) . centaur-tabs-local-mode)
  :custom
  (centaur-tabs-style "bar")
  (centaur-tabs-height 32)
  (centaur-tabs-set-icons t)
  (centaur-tabs-set-bar 'left)
  (centaur-tabs-cycle-scope 'tabs)
  :config
  (centaur-tabs-mode 1)
  (centaur-tabs-group-by-projectile-project)
  :general
  ('motion
   "M-l" '(centaur-tabs-forward :which-key "Next tab")
   "M-h" '(centaur-tabs-backward :which-key "Previous tab")
   )
  (leader-def
    "t t" '(centaur-tabs--create-new-tab :which-key "New tab")
    "t l" '(centaur-tabs-forward-group :which-key "Go to next tab group")
    "t h" '(centaur-tabs-backward-group :which-key "Go to previous tab group")
    "t G" '(centaur-tabs-select-end-tab :which-key "Select the last tab of the group")
    "t s" '(centaur-tabs-counsel-switch-group :which-key "Show buffer groups")
    "t p" '(centaur-tabs-group-by-projectile-project :which-key "Group by projectile project")
    "t g" '(centaur-tabs-group-buffer-groups :which-key "Use centaur's buffer grouping")
    ;; "t g g" '(centaur-tabs-select-beg-tab :which-key "Select the first tab of the group")
  )
)
#+end_src

*** COMMENT b
#+begin_src emacs-lisp
(use-package centaur-tabs
  :custom
  ;; (centaur-tabs-plain-icons nil)
  ;; (centaur-tabs-gray-out-icons 'buffer)
  ;; (centaur-tabs-set-bar 'left)
  ;; (x-underline-at-descent-line t)  ; Set this only if centaur-tabs-set-bar is 'under
  ;; (centaur-tabs-set-modified-marker t)
  ;; (centaur-tabs-close-button "✕")
  ;; (centaur-tabs-modified-marker "•")
  :config
  (centaur-tabs-mode 1)

#+end_src

** COMMENT Tab Bar
Frame-local tabs.

#+begin_src emacs-lisp :tangle no
(use-package tab-bar
  :demand
  :custom
  ; Defines what to do when the last tab is closed
  (tab-bar-close-last-tab-choice 'tab-bar-mode-disable)
  (tab-bar-close-tab-select 'left)
  (tab-bar-new-tab-choice "*scratch*")
  (tab-bar-show 1)
  :config
  (tab-bar-mode 1)
  :general
  ('motion
    "M-l" '(tab-bar-switch-to-next-tab :which-key "Next tab")
    "M-h" '(tab-bar-switch-to-prev-tab :which-key "Previous tab")
    )

  (leader-def
    "t"   '(:ignore t :which-key "tab")
    "t f" '(find-file-other-tab :which-key "Edit file in another tab")
    "t t" '(tab-bar-new-tab :which-key "New tab")
    "t q" '(tab-bar-close-tab :which-key "Close tab")
    "t c" '(tab-bar-close-other-tabs :which-key "Close all tabs, except the selected one")
    "t r" '(tab-bar-switch-to-recent-tab :which-key "Recent tab")
    "t l" '(tab-bar-switch-to-next-tab :which-key "Next tab")
    "t h" '(tab-bar-switch-to-prev-tab :which-key "Previous tab")
    "t u" '(tab-bar-undo-close-tab :which-key "Restore the last closed tab")
    ;; "t h" '(tab-bar-history-mode :which-key "Toggle tab history mode")

    )
)
    ; Rebind join, and lookup (default K and J vim keybindigs)
    ;; "k" '(evil-lookup :which-key "Look up the keyword at point")
    ;; "j" '(evil-join :which-key "Join the selected lines")
#+end_src

