.config/emacs/init.el

(use-package dabbrev :straight (:type built-in)
  :general
  (general-swap-key nil 'global
    "M-/" "C-M-/"))

(use-package rainbow-mode
  :preface
  (defun rainbow-turn-off-hexadecimal ()
    "Turn off hexadecimal colours in rainbow-mode."
    (interactive)
    (font-lock-remove-keywords
     nil
     `(,@rainbow-hexadecimal-colors-font-lock-keywords))
    (font-lock-fontify-buffer))

  (defun rainbow-turn-off-words ()
    "Turn off word colours in rainbow-mode."
    (interactive)
    (font-lock-remove-keywords
     nil
     `(,@rainbow-x-colors-font-lock-keywords))
    (font-lock-fontify-buffer))
  :hook ((prog-mode text-mode) . rainbow-mode)
  :config ())  ; Show message if verbose is activated

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :config ())  ; Show message if verbose is activated

(use-package good-scroll
:demand
:preface
:custom
(good-scroll-step 50)
:config
(good-scroll-mode 1)
:general
("<wheel-up>"   'good-scroll-up
 "<wheel-down>" 'good-scroll-down
 ;; [remap scroll-up-command]          'good-scroll-up
 ;; [remap scroll-down-command]          'good-scroll-down
 [next] #'good-scroll-up-full-screen
 [prior] #'good-scroll-down-full-screen))

(use-package highlight-parentheses
  :hook ((prog-mode text-mode) . highlight-parentheses-mode)
  :config ())  ; Show message if verbose is activated

(use-package highlight-numbers
  :hook ((prog-mode text-mode) . highlight-numbers-mode)
  :config ())  ; Show message if verbose is activated
;; '(highlight-numbers-number ((t (:foreground "#f0ad6d"))))

(use-package beacon
  :demand
  :custom
  (beacon-size 40)
  (beacon-color 0.6)
  ;; (beacon-blink-duration)
  ;; (beacon-blink-delay)
  (beacon-blink-when-window-scrolls t)
  (beacon-blink-when-window-changes t)
  (beacon-blink-when-focused t)
  (beacon-blink-when-point-moves t)
  ;; (beacon-dont-blink-major-modes)
  ;; (beacon-dont-blink-predicates)
  ;; (beacon-dont-blink-commands)
  ;; (beacon-push-mark)
  :config
  ;; Disable it only in specific buffers
  ;; (setq-local beacon-mode nil).
  (beacon-mode 1))

(use-package treemacs
  :hook
