.config/emacs/TANGLE.org
** Treemacs
A tree layout file explorer for Emacs
https://github.com/Alexander-Miller/treemacs

#+begin_src emacs-lisp
(use-package treemacs
  :hook
  ((gdscript-mode) . (lambda () (save-selected-window (treemacs-select-window))))
  :custom
  ;; (treemacs-display-in-side-window          nil)
  ;; (treemacs-expand-after-init               t)
  ;; (treemacs-position                        'left)
  ;; (treemacs-silent-filewatch                nil)
  ;; (treemacs-silent-refresh                  nil)
  ;; (treemacs-sorting                         'alphabetic-asc)
  ;; (treemacs-user-mode-line-format           "none")
  (treemacs-width                           28)
  (treemacs-follow-after-init t)
  (treemacs-no-delete-other-windows nil)
  :config
  (add-hook
   'gdscript-mode-hook
   (lambda () (run-with-timer 10.0 nil #'treemacs-select-window)))
  (treemacs-follow-mode t)
  ;; (treemacs-tag-follow-mode t)
  ;; (treemacs-display-current-project-exclusively)
  (treemacs-fringe-indicator-mode 'always)
  (treemacs-git-mode 'simple)
  (treemacs-filewatch-mode t)
  (treemacs-indent-guide-mode t)
  (treemacs-project-follow-mode t)
  (treemacs-hide-gitignored-files-mode nil)

  ;; (pcase (cons (not (null (executable-find "git")))
  ;;              (not (null treemacs-python-executable)))
  ;;   (`(t . t)
  ;;    (treemacs-git-mode 'deferred))
  ;;   (`(t . _)
  ;;    (treemacs-git-mode 'simple)))
  :general
  ("M-0"   #'treemacs-select-window)
  (leader-def
	"0 0" #'treemacs
	"0 b" #'treemacs-bookmark
	"0 t" #'treemacs-find-tag
	"0 f" #'treemacs-find-file
	"0 d" #'treemacs-delete-other-windows
	)
)
#+end_src
   
*** Evil
Evil integration in treemacs
https://github.com/Alexander-Miller/treemacs/blob/master/src/extra/treemacs-evil.el

#+begin_src elisp
(use-package treemacs-evil
  :after (treemacs evil)
  :demand)
#+end_src

*** Projectile
Allow quickly add your projectile projects to treemacs.
https://github.com/Alexander-Miller/treemacs

#+begin_src elisp
(use-package treemacs-projectile
  :after (treemacs projectile)
  :demand)
#+end_src

*** Git

#+begin_src elisp
(use-package treemacs-magit
  :after (treemacs magit)
  :demand)
#+end_src

*** COMMENT Icons Dired

#+begin_src elisp
(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :ensure t)
#+end_src

*** COMMENT Persp

#+begin_src elisp
(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
  :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  :demand
  :config (treemacs-set-scope-type 'Perspectives))
#+end_src

** Folding
*** COMMENT Origami
A text folding minor mode for Emacs.
https://github.com/gregsexton/origami.el

#+begin_src emacs-lisp
(setq byte-compile-warnings '(cl-functions))  ; Disable "Package cl is deprecated" message

(use-package origami
:demand
:config
(global-origami-mode 1))
#+end_src>

*** Vimish Fold

#+begin_src elisp
(use-package vimish-fold
  :after evil
  :demand
  :config
  (vimish-fold-global-mode 1))
#+end_src

**** Evil Vimish Fold

#+begin_src elisp
(use-package evil-vimish-fold
  :after (evil vimish-fold)
  :demand
  :hook ((prog-mode conf-mode text-mode) . evil-vimish-fold-mode))
#+end_src

* Files
Support for editing files.

#+begin_src emacs-lisp
(use-package files :straight (:type built-in)
  :demand
  :preface
  (defun +/save-buffers-kill-emacs (&optional arg)
	"Offer to save each buffer(once only, no modified buffers exist asking), then kill this Emacs process.
With prefix ARG, silently save all file-visiting buffers, then kill."
	(interactive "P")
	(save-some-buffers arg t)
	(and (or (not (fboundp 'process-list))
		 ;; process-list is not defined on MSDOS.
		 (let ((processes (process-list))
		       active)
		   (while processes
		     (and (memq (process-status (car processes)) '(run stop open listen))
			  (process-query-on-exit-flag (car processes))
			  (setq active t))
		     (setq processes (cdr processes)))
		   (or (not active)
		       (progn (list-processes t)
			      (yes-or-no-p "Active processes exist; kill them and exit anyway? ")))))
	     ;; Query the user for other things, perhaps.
	     (run-hook-with-args-until-failure 'kill-emacs-query-functions)
	     (or (null confirm-kill-emacs)
		 (funcall confirm-kill-emacs "Really exit Emacs? "))
	     (kill-emacs)))
  :custom
  (vc-handled-backends nil)
  (vc-follow-symlinks t)
  (vc-git-print-log-follow nil)
  (find-file-visit-truename t)
  :config
  (fset 'save-buffers-kill-emacs '+/save-buffers-kill-emacs)
  :general
  (leader-def
    "f" '(:ignore t :which-key "file")
    "f f" #'(find-file :wk "find")
    "f c" #'((lambda () (interactive) (find-file "~/.config/emacs/TANGLE.org")) :wk "config")
    "b k" #'(kill-current-buffer :wk "kill current buffer")
    "b K" #'(kill-buffer :wk "kill buffer")
    "b n" #'(next-buffer :wk "next buffer")
    "b p" #'(previous-buffer :wk "previous buffer")
))
#+end_src

** Auto Revert
Revert individual buffers when files on disk change.

#+begin_src emacs-lisp
(use-package autorevert :straight (:type built-in)
  :demand
  :custom
  (auto-revert-interval 3)
  (global-auto-revert-non-file-buffers t)
  :config
  (global-auto-revert-mode 1))
#+end_src

** COMMENT Backup 
Backups of edited data files.

#+begin_src emacs-lisp :tangle early-init.el
(setq
make-backup-files nil
backup-inhibited nil
)
#+end_src

** COMMENT Dired
Directory editing.

#+begin_src emacs-lisp :tangle no
(use-package dired
  :straight (:type built-in)
  :custom
  (dired-listing-switches "-ahl -v --group-directories-first")
  (dired-auto-revert-buffer t)  ; Automatically revert Dired buffers on revisiting their directory
  (dired-dwim-target t)  ; suggest a target for moving/copying intelligently
  (dired-hide-details-hide-symlink-targets nil)
  (dired-recursive-copies  'always)  ; Always copy/delete recursively
  (dired-recursive-deletes 'top)  ; Whether dired deletes directories recursively
  (dired-create-destination-dirs 'ask)
  :config
  ; Don't complain about this command being disabled when we use it
  (put 'dired-find-alternate-file 'disabled nil)
  :general
  (:states 'normal :keymaps 'dired-mode-map
	  "h" #'dired-up-directory
	  "l" #'dired-find-file))

;; single invocation example
;; (general-translate-key nil 'evil-normal-state-keymap
;;   "n" "j"
;;   "e" "k"
;;   ...)
;; cycling keys en masse
;; (dolist (keymap keymaps-with-hjkl-keybindings)
;;   (general-translate-key 'normal keymap
;;     ;; colemak hnei is qwerty hjkl
;;     "n" "j"
;;     "e" "k"
;;     "i" "l"
;;     ;; add back nei
;;     "j" "e"
;;     "k" "n"
;;     "l" "i"))
#+end_src


*** All the Icons Dired
A library for inserting Developer icons
https://github.com/domtronn/all-the-icons.el

#+begin_src emacs-lisp :tangle no
  (use-package all-the-icons-dired
    :after dired
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src
    
*** Ranger

#+begin_src emacs-lisp
  ;; (use-package ranger
  ;; :demand
  ;; :init (ranger-override-dired-mode t))
  ;; :init (setq ranger-override-dired t))
  ;; :custom 
  ;; (ranger-cleanup-on-disable t)
  ;; (ranger-excluded-extensions '("mkv" "iso" "mp4"))
  ;; (ranger-deer-show-details t)
  ;; (ranger-max-preview-size 10)
  ;; (ranger-show-literal nil)
  ;; (ranger-hide-cursor nil)
#+end_src

*** Rsync
Asynchronous rsync from dired
https://github.com/stsquad/dired-rsync

#+begin_src emacs-lisp :tangle no
(use-package dired-rsync
  :general
  (dired-mode-map "C-c C-r" 'dired-rsync))
#+end_src>

*** Diredfl
Extra font lock rules for a more colourful dired
https://github.com/purcell/diredfl

#+begin_src emacs-lisp :tangle no
(use-package diredfl
  :hook (dired-mode . diredfl-mode))
#+end_src>

*** Diredx

#+begin_src emacs-lisp :tangle no
  (use-package dired-x
	:straight nil
	:hook (dired-mode . dired-omit-mode)
	:config
	(setq dired-omit-verbose nil
		  dired-omit-files
		  (concat dired-omit-files
				  "\\|^.DS_Store\\'"
				  "\\|^.project\\(?:ile\\)?\\'"
				  "\\|^.\\(svn\\|git\\)\\'"
				  "\\|^.ccls-cache\\'"
				  "\\|\\(?:\\.js\\)?\\.meta\\'"
				  "\\|\\.\\(?:elc\\|o\\|pyo\\|swp\\|class\\)\\'"))
	;; Disable the prompt about whether I want to kill the Dired buffer for a
	;; deleted directory. Of course I do!
	(setq dired-clean-confirm-killing-deleted-buffers nil))
	;; Let OS decide how to open certain files
	;; (map! :map dired-mode-map
	;; 	  :localleader
	;; 	  "h" #'dired-omit-mode))
#+end_src

*** Fd-dired
https://github.com/yqrashawn/fd-dired

#+begin_src emacs-lisp :tangle no
(use-package fd-dired
  :defer t
  :init
  (global-set-key [remap find-dired] #'fd-dired))
#+end_src

*** Dired Aux

#+begin_src emacs-lisp :tangle no
  (use-package dired-aux
	:straight nil
	:defer t
	:config
	(setq dired-create-destination-dirs 'ask
		  dired-vc-rename-file t))
#+end_src

*** Diff-hl
Highlight uncommitted changes using VC
https://github.com/dgutov/diff-hl

#+begin_src emacs-lisp :tangle no
(use-package diff-hl
  :hook 
  (dired-mode . diff-hl-dired-mode-unless-remote)
  (magit-post-refresh . diff-hl-magit-post-refresh)
  :config
  ; use margin instead of fringe
  (diff-hl-margin-mode))
#+end_src>

*** Single
Reuse the current dired buffer to visit a directory
https://github.com/crocket/dired-single

#+begin_src emacs-lisp :tangle no
  (use-package dired-single
    :after dired)
    ;:config
    ;(:keymaps '(dired-mode-map evil-normal-state-map)
    ;(evil-collection-define-key 'normal 'dired-mode-map
     ;"h" 'dired-single-up-directory
     ;"l" 'dired-single-buffer))
#+end_src

*** Hide Dotfiles
Hide dotfiles in dired
https://github.com/mattiasb/dired-hide-dotfiles

#+begin_src emacs-lisp :tangle no
  (use-package dired-hide-dotfiles
    :after dired
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :general
    (dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src    

*** Open
Open files from dired using using custom actions

#+begin_src emacs-lisp :tangle no
  (use-package dired-open
    :after dired
    :commands
    (dired dired-jump)
    :config
    ;; Doesn't work as expected!
    ;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    ;; -- OR! --
    (setq dired-open-extensions '(("png" . "sxiv")
				  ("mkv" . "mpv"))))
#+end_src
    
*** Peep Dired
*** Empty

#+begin_src emacs-lisp
  ;(setq split-height-threshold nil)
  ;(setq split-width-threshold 0)

  ;(custom-set-variables
  ; '(ediff-window-setup-function 'ediff-setup-windows-plain)
  ; '(ediff-diff-options "-w")
  ; '(ediff-split-window-function 'split-window-horizontally))
  ;(add-hook 'ediff-after-quit-hook-internal 'winner-undo)

  ;(setq split-width-threshold (- (window-width) 10))
  ;(setq split-height-threshold nil)
  ;
  ;(defun count-visible-buffers (&optional frame)
  ;  "Count how many buffers are currently being shown. Defaults to selected frame."
  ;  (length (mapcar #'window-buffer (window-list frame))))
  ;
  ;(defun do-not-split-more-than-two-windows (window &optional horizontal)
  ;  (if (and horizontal (> (count-visible-buffers) 1))
  ;      nil
  ;    t))
  ;
  ;(advice-add 'window-splittable-p :before-while #'do-not-split-more-than-two-windows)
#+end_src

** COMMENT Find File
Finding files.

** No Litering
Help keeping ~/.config/emacs clean
https://github.com/emacscollective/no-littering

#+begin_src emacs-lisp :tangle no :noweb-ref no-littering
(use-package no-littering
  :demand
  :init
  (setq 
   no-littering-etc-directory (expand-file-name "conf" user-emacs-directory)
   no-littering-var-directory (expand-file-name "data" user-emacs-directory)
   custom-file (expand-file-name "custom.el" user-emacs-directory)
   auto-save-file-name-transforms `((".*" ,(no-littering-expand-var-file-name "auto-save") t))
   auto-save-list-file-name `((".*" ,(no-littering-expand-var-file-name "auto-save-list") t))
   ;; url-history-file (expand-file-name "data/url/history" user-emacs-directory)))
   url-history-file (no-littering-expand-var-file-name "url/history")))
#+end_src

