.config/emacs/init.el
  ((gdscript-mode) . (lambda () (save-selected-window (treemacs-select-window))))
  :custom
  ;; (treemacs-display-in-side-window          nil)
  ;; (treemacs-expand-after-init               t)
  ;; (treemacs-position                        'left)
  ;; (treemacs-silent-filewatch                nil)
  ;; (treemacs-silent-refresh                  nil)
  ;; (treemacs-sorting                         'alphabetic-asc)
  ;; (treemacs-user-mode-line-format           "none")
  (treemacs-width                           28)
  (treemacs-follow-after-init t)
  (treemacs-no-delete-other-windows nil)
  :config
  (add-hook
   'gdscript-mode-hook
   (lambda () (run-with-timer 10.0 nil #'treemacs-select-window)))
  (treemacs-follow-mode t)
  ;; (treemacs-tag-follow-mode t)
  ;; (treemacs-display-current-project-exclusively)
  (treemacs-fringe-indicator-mode 'always)
  (treemacs-git-mode 'simple)
  (treemacs-filewatch-mode t)
  (treemacs-indent-guide-mode t)
  (treemacs-project-follow-mode t)
  (treemacs-hide-gitignored-files-mode nil)

  ;; (pcase (cons (not (null (executable-find "git")))
  ;;              (not (null treemacs-python-executable)))
  ;;   (`(t . t)
  ;;    (treemacs-git-mode 'deferred))
  ;;   (`(t . _)
  ;;    (treemacs-git-mode 'simple)))
  :general
  ("M-0"   #'treemacs-select-window)
  (leader-def
	"0 0" #'treemacs
	"0 b" #'treemacs-bookmark
	"0 t" #'treemacs-find-tag
	"0 f" #'treemacs-find-file
	"0 d" #'treemacs-delete-other-windows
	)
)

(use-package treemacs-evil
  :after (treemacs evil)
  :demand)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :demand)

(use-package treemacs-magit
  :after (treemacs magit)
  :demand)

(use-package vimish-fold
  :after evil
  :demand
  :config
  (vimish-fold-global-mode 1))

(use-package evil-vimish-fold
  :after (evil vimish-fold)
  :demand
  :hook ((prog-mode conf-mode text-mode) . evil-vimish-fold-mode))

(use-package files :straight (:type built-in)
  :demand
  :preface
  (defun +/save-buffers-kill-emacs (&optional arg)
	"Offer to save each buffer(once only, no modified buffers exist asking), then kill this Emacs process.
With prefix ARG, silently save all file-visiting buffers, then kill."
	(interactive "P")
	(save-some-buffers arg t)
	(and (or (not (fboundp 'process-list))
		 ;; process-list is not defined on MSDOS.
		 (let ((processes (process-list))
		       active)
		   (while processes
		     (and (memq (process-status (car processes)) '(run stop open listen))
			  (process-query-on-exit-flag (car processes))
			  (setq active t))
		     (setq processes (cdr processes)))
		   (or (not active)
		       (progn (list-processes t)
			      (yes-or-no-p "Active processes exist; kill them and exit anyway? ")))))
	     ;; Query the user for other things, perhaps.
	     (run-hook-with-args-until-failure 'kill-emacs-query-functions)
	     (or (null confirm-kill-emacs)
		 (funcall confirm-kill-emacs "Really exit Emacs? "))
	     (kill-emacs)))
  :custom
  (vc-handled-backends nil)
  (vc-follow-symlinks t)
  (vc-git-print-log-follow nil)
  (find-file-visit-truename t)
  :config
  (fset 'save-buffers-kill-emacs '+/save-buffers-kill-emacs)
  :general
  (leader-def
    "f" '(:ignore t :which-key "file")
    "f f" #'(find-file :wk "find")
    "f c" #'((lambda () (interactive) (find-file "~/.config/emacs/TANGLE.org")) :wk "config")
    "b k" #'(kill-current-buffer :wk "kill current buffer")
    "b K" #'(kill-buffer :wk "kill buffer")
    "b n" #'(next-buffer :wk "next buffer")
    "b p" #'(previous-buffer :wk "previous buffer")
))

(use-package autorevert :straight (:type built-in)
  :demand
  :custom
  (auto-revert-interval 3)
  (global-auto-revert-non-file-buffers t)
  :config
  (global-auto-revert-mode 1))
