.config/emacs/TANGLE.org
*** COMMENT Vterm
ansi-term

#+begin_src emacs-lisp
(use-package vterm :straight (:type built-in)
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))
#+end_src

** Server
Emacs running as a server process.

#+begin_src emacs-lisp
  ;(server-start)  ; Allow this Emacs process to be a server for client processes
  ;(setq show-value-server-raise-frame t)  ; If non-nil, raise frame when switching to a buffer
  ;(setq server-window (pop-to-buffer (current-buffer) t)) ; Specification of the window to use for selecting Emacs server buffers
#+end_src

** Magit
A Git porcelain inside Emacs.
https://github.com/magit/magit

#+begin_src emacs-lisp
(use-package magit
  ;; :custom
  ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :config
  (with-eval-after-load 'magit-mode (add-hook 'after-save-hook 'magit-after-save-refresh-status t))
  ;; Remove some functions
  ;; (with-eval-after-load 'magit-diff
  ;; 	(remove-hook 'magit-section-movement-hook
  ;; 				 'magit-hunk-set-window-start))
  :general
  (leader-def
    "g"     '(:ignore t :which-key "magit")
    "g s"   'magit-status
    "g d"   'magit-diff-unstaged
    "g c"   'magit-branch-or-checkout
    "g l"   '(:ignore t :which-key "log")
    "g l c" 'magit-log-current
    "g l f" 'magit-log-buffer-file
    "g b"   'magit-branch
    "g P"   'magit-push-current
    "g p"   'magit-pull-branch
    "g f"   'magit-fetch
    "g F"   'magit-fetch-all
    "g r"   'magit-rebase))
#+end_src

** COMMENT EFS
A free/libre and open-source extensible framework that revolutionizes the graphical capabilities of Emacs.
https://github.com/emacs-eaf/emacs-application-framework

#+begin_src emacs-lisp
;; (use-package eaf
;;   ;; :straight (:type built-in)
;;   :straight nil
;;   :load-path "~/.config/emacs/site-lisp/emacs-application-framework"
;;   :demand
;;   :custom
;;   ; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
;;   (eaf-browser-continue-where-left-off t)
;;   (eaf-browser-enable-adblocker t)
;;   (browse-url-browser-function 'eaf-open-browser)
;;   :config
;;   (defalias 'browse-web #'eaf-open-browser)
;;   (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
;;   (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
;;   (eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;   (eaf-bind-key nil "M-q" eaf-browser-keybinding) ;; unbind, see more in the Wiki
;; )

;; (require 'eaf-browser)
;; (require 'eaf-pdf-viewer)
;; (require 'eaf-demo)
;; (require 'eaf-rss-reader)

(use-package eaf
:straight '(eaf :type git
                :host github
		:repo "emacs-eaf/emacs-application-framework"
		:files ("*"))
)
#+end_src

*** COMMENT Demo

#+begin_src emacs-lisp
(use-package eaf-rss-reader
  :straight (:type built-in)
  :after eaf
  :demand
)
#+end_src

*** COMMENT RSS Reader

#+begin_src emacs-lisp
(use-package eaf-rss-reader
  :straight (:type built-in)
  :after eaf
  :demand
)
#+end_src

* Communication
Communications, networking, and remote access to files.

** COMMENT Elfeed
An Emacs Atom/RSS feed reader.
https://github.com/skeeto/elfeed

#+begin_src emacs-lisp
(use-package elfeed
  :custom
  (elfeed-search-filter "@3-days-ago")
  :general
  (leader-def
	"e f" #'elfeed)
  :config ())  ; Show message if verbose is activated
#+end_src

*** COMMENT Elfeed Org
Configure the Elfeed RSS reader with an Orgmode file
https://github.com/remyhonig/elfeed-org

#+begin_src emacs-lisp
(use-package elfeed-org
  ;; :after elfeed
  :demand
  :custom
  (rmh-elfeed-org-files (list "/mnt/files/Ricardo/Documents/note/rss.org"))
  :config ())  ; Show message if verbose is activated
#+end_src

** COMMENT ERC

#+begin_src emacs-lisp
(use-package erc :straight (:type built-in)
  :commands (erc erc-tls)
  :config
  (setq erc-server "irc.libera.chat"
		erc-nick "raisak"
		;; erc-user-full-name "Ricardo Gomez"
		erc-track-shorten-start 8
		erc-autojoin-channels-alist '(("irc.libera.chat" "#emacs" "#systemcrafters"))
		erc-kill-buffer-on-part t
        erc-auto-query 'bury)
  :general
  (leader-def
	"e r" '(erc-tls :which-key "ERC")))
#+end_src

* Programming
Support for programming in other languages.

** Languages
Modes for editing programming languages.

*** COMMENT Html

#+begin_src emacs-lisp
(use-package mhtml :straight (:type built-in)

)
#+end_src    

*** COMMENT Css
Cascading Style Sheets (CSS) editing mode.

#+begin_src emacs-lisp
(use-package css :straight (:type built-in))
#+end_src

**** LessCss
Less CSS mode.

#+begin_src emacs-lisp
(use-package less-css-mode :straight (:type built-in)
  :config ())  ; Show message if verbose is activated
#+end_src

*** COMMENT JavaScript
Major mode for editing JavaScript

#+begin_src emacs-lisp
(use-package js :straight (:type built-in)
  :config (message "Entraste en Javascript"))  ; Show message if verbose is activated
#+end_src

*** COMMENT C
Support for the C language and related languages.

**** Cpp
Highlight or hide text according to cpp conditionals.

#+begin_src emacs-lisp
(use-package cpp :straight (:type built-in)
  ;; :ghook 'c++-mode-hook
  :config
  (message "hello there!"))
;compile c++ whit f9
;(defun code-compile ()
;  (interactive)
;  (unless (file-exists-p "Makefile")
;    (set (make-local-variable 'compile-command)
;     (let ((file (file-name-nondirectory buffer-file-name)))
;       (format "%s -o %s %s"
;           (if  (equal (file-name-extension file) "cpp") "g++" "gcc" )
;           (file-name-sans-extension file)
;           file)))
;    (compile compile-command)))
;
;(global-set-key [f9] 'code-compile)

;; clang-format can be triggered using C-c C-f
;; Create clang-format file using google style
;; clang-format -style=google -dump-config > .clang-format
;; (require 'clang-format)
;; (global-set-key (kbd "C-c C-f") 'clang-format-region)

;; (require 'modern-cpp-font-lock)
;; (modern-c++-font-lock-global-mode t)
#+end_src

*** GDScript
Major mode for Godot's GDScript language
https://github.com/godotengine/emacs-gdscript-mode

#+begin_src emacs-lisp
(use-package gdscript-mode
  :preface
  (defun +/lsp--gdscript-ignore-errors (original-function &rest args)
	"Ignore the error message resulting from Godot not replying to the `JSONRPC' request."
	(if (string-equal major-mode "gdscript-mode")
		(let ((json-data (nth 0 args)))
		  (if (and (string= (gethash "jsonrpc" json-data "") "2.0")
				   (not (gethash "id" json-data nil))
				   (not (gethash "method" json-data nil)))
			  nil ; (message "Method not found")
			(apply original-function args)))
	  (apply original-function args)))
  :custom
  (gdscript-use-tab-indents t)
  (gdscript-indent-offset 4)
  (gdscript-godot-executable "/bin/godot")
  (gdscript-gdformat-save-and-format t)
  :config
  ;; Runs the function `+/lsp--gdscript-ignore-errors` around `lsp--get-message-type` to suppress unknown notification errors.
  (advice-add #'lsp--get-message-type :around #'+/lsp--gdscript-ignore-errors))
#+end_src

*** Prog 
Generic programming mode, from which others derive.

#+begin_src emacs-lisp
(use-package prog-mode :straight (:type built-in)
  :demand
  :custom
  (prettify-symbols-unprettify-at-point 'right-edge)
  (prettify-symbols-alist '())
  :config
  (global-prettify-symbols-mode 1)

  (setq prettify-symbols-alist '(("TODO" . "")
	                         ("WAIT" . "")        
   				 ("NOPE" . "")
				 ("DONE" . "")
				 ("[#A]" . "")
				 ("[#B]" . "")
 				 ("[#C]" . "")
				 ("[ ]" . "")
				 ("[X]" . "")
				 ("[-]" . "")
				 ("#+BEGIN_SRC" . "")
				 ("#+END_SRC" . "―")
				 (":PROPERTIES:" . "")
				 (":END:" . "―")
				 ("#+STARTUP:" . "")
				 ("#+TITLE: " . "")
				 ("#+RESULTS:" . "")
				 ("#+NAME:" . "")
				 ("#+ROAM_TAGS:" . "")
				 ("#+FILETAGS:" . "")
				 ("#+HTML_HEAD:" . "")
				 ("#+SUBTITLE:" . "")
				 ("#+AUTHOR:" . "")
				 (":Effort:" . "")
				 ("SCHEDULED:" . "")
				 ("DEADLINE:" . "")
				 ("lambda" . 955)
				 ))
)
#+end_src

*** COMMENT Python
Python Language’s flying circus support for Emacs

#+begin_src emacs-lisp
;; (use-package python
  ;; :straight (:type built-in)
  ;; :custom
  ;; (python-shell-interpreter "python")
  ;; (dap-python-executable "python3")
  ;; (dap-python-debugger 'debugpy)
  ;; :config ())  ; Show message if verbose is activated
#+end_src

*** COMMENT Sh Script
Shell script editing commands for Emacs.

#+begin_src emacs-lisp
(defun +sh--match-variables-in-quotes (limit)
  "Search for variables in double-quoted strings bounded by LIMIT."
  (with-syntax-table sh-mode-syntax-table
    (let (res)
      (while
          (and (setq res
                     (re-search-forward
                      "[^\\]\\(\\$\\)\\({.+?}\\|\\<[a-zA-Z0-9_]+\\|[@*#!]\\)"
                      limit t))
               (not (eq (nth 3 (syntax-ppss)) ?\"))))
      res)))

(defun +sh--match-command-subst-in-quotes (limit)
  "Search for variables in double-quoted strings bounded by LIMIT."
  (with-syntax-table sh-mode-syntax-table
    (let (res)
      (while
          (and (setq res
                     (re-search-forward "[^\\]\\(\\$(.+?)\\|`.+?`\\)"
                                        limit t))
               (not (eq (nth 3 (syntax-ppss)) ?\"))))
      res)))

(defvar +sh-builtin-keywords
  '("cat" "cd" "chmod" "chown" "cp" "curl" "date" "echo" "find" "git" "grep"
    "kill" "less" "ln" "ls" "make" "mkdir" "mv" "pgrep" "pkill" "pwd" "rm"
    "sleep" "sudo" "touch")
  "A list of common shell commands to be fontified especially in `sh-mode'.")

(use-package sh-script
  :straight (:type built-in)
  :mode ("\\.bats\\'" . sh-mode)
  :mode ("\\.\\(?:zunit\\|env\\)\\'" . sh-mode)
  :mode ("/bspwmrc\\'" . sh-mode)
  ;; :custom
  ;; (sh-indent-after-continuation 'always)
  :config
  ; Recognize function names with dashes in them
  (add-to-list 'sh-imenu-generic-expression
			   '(sh (nil "^\\s-*function\\s-+\\([[:alpha:]_-][[:alnum:]_-]*\\)\\s-*\\(?:()\\)?" 1)
					(nil "^\\s-*\\([[:alpha:]_-][[:alnum:]_-]*\\)\\s-*()" 1)))

  ;; 1. Fontifies variables in double quotes
  ;; 2. Fontify command substitution in double quotes
  ;; 3. Fontify built-in/common commands (see `+sh-builtin-keywords')
  (+/add-hook 'sh-mode-hook
	(defun +sh-init-extra-fontification-h ()
	  (font-lock-add-keywords
	   nil `((+sh--match-variables-in-quotes
			  (1 'font-lock-constant-face prepend)
			  (2 'font-lock-variable-name-face prepend))
			 (+sh--match-command-subst-in-quotes
			  (1 'sh-quoted-exec prepend))
			 (,(regexp-opt +sh-builtin-keywords 'symbols)
			  (0 'font-lock-type-face append)))))))
#+end_src

**** Company Shell

#+begin_src emacs-lisp :tangle no
  (use-package! company-shell
  :when (featurep! :completion company)
  :unless (featurep! +lsp)
  :after sh-script
  :config
  (set-company-backend! 'sh-mode '(company-shell company-files))
  (setq company-shell-delete-duplicates t))
 #+end_src

**** PowerShell

#+begin_src emacs-lisp :tangle no
(use-package! powershell
  :when (featurep! +powershell)
  :defer t
  :config
  (when (featurep! +lsp)
    (add-hook 'powershell-mode-local-vars-hook #'lsp!)))
#+end_src

*** C#
Mode for editing C# in emacs.
https://github.com/emacs-csharp/csharp-mode

#+begin_src emacs-lisp
(use-package csharp-mode)
#+end_src
   
*** Yaml

#+begin_src elisp
(use-package yaml-mode
  ;; :general
  ;; ('yaml-mode-map "\C-m" 'newline-and-indent)
)
#+end_src

*** Web
Mode for editing web templates aka HTML files embedding parts and blocks.
https://github.com/fxbois/web-mode

#+begin_src emacs-lisp
(use-package web-mode)
#+end_src

*** Vimrc

#+begin_src emacs-lisp
(use-package vimrc-mode)
;; (add-to-list 'auto-mode-alist '("\\.vim\\(rc\\)?\\'" . vimrc-mode))
#+end_src


** Tools
