.config/emacs/init.el

;(server-start)  ; Allow this Emacs process to be a server for client processes
;(setq show-value-server-raise-frame t)  ; If non-nil, raise frame when switching to a buffer
;(setq server-window (pop-to-buffer (current-buffer) t)) ; Specification of the window to use for selecting Emacs server buffers

(use-package magit
  ;; :custom
  ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :config
  (with-eval-after-load 'magit-mode (add-hook 'after-save-hook 'magit-after-save-refresh-status t))
  ;; Remove some functions
  ;; (with-eval-after-load 'magit-diff
  ;; 	(remove-hook 'magit-section-movement-hook
  ;; 				 'magit-hunk-set-window-start))
  :general
  (leader-def
    "g"     '(:ignore t :which-key "magit")
    "g s"   'magit-status
    "g d"   'magit-diff-unstaged
    "g c"   'magit-branch-or-checkout
    "g l"   '(:ignore t :which-key "log")
    "g l c" 'magit-log-current
    "g l f" 'magit-log-buffer-file
    "g b"   'magit-branch
    "g P"   'magit-push-current
    "g p"   'magit-pull-branch
    "g f"   'magit-fetch
    "g F"   'magit-fetch-all
    "g r"   'magit-rebase))

(use-package gdscript-mode
  :preface
  (defun +/lsp--gdscript-ignore-errors (original-function &rest args)
	"Ignore the error message resulting from Godot not replying to the `JSONRPC' request."
	(if (string-equal major-mode "gdscript-mode")
		(let ((json-data (nth 0 args)))
		  (if (and (string= (gethash "jsonrpc" json-data "") "2.0")
				   (not (gethash "id" json-data nil))
				   (not (gethash "method" json-data nil)))
			  nil ; (message "Method not found")
			(apply original-function args)))
	  (apply original-function args)))
  :custom
  (gdscript-use-tab-indents t)
  (gdscript-indent-offset 4)
  (gdscript-godot-executable "/bin/godot")
  (gdscript-gdformat-save-and-format t)
  :config
  ;; Runs the function `+/lsp--gdscript-ignore-errors` around `lsp--get-message-type` to suppress unknown notification errors.
  (advice-add #'lsp--get-message-type :around #'+/lsp--gdscript-ignore-errors))

(use-package prog-mode :straight (:type built-in)
  :demand
  :custom
  (prettify-symbols-unprettify-at-point 'right-edge)
  (prettify-symbols-alist '())
  :config
  (global-prettify-symbols-mode 1)

  (setq prettify-symbols-alist '(("TODO" . "")
	                         ("WAIT" . "")        
   				 ("NOPE" . "")
				 ("DONE" . "")
				 ("[#A]" . "")
				 ("[#B]" . "")
 				 ("[#C]" . "")
				 ("[ ]" . "")
				 ("[X]" . "")
				 ("[-]" . "")
				 ("#+BEGIN_SRC" . "")
				 ("#+END_SRC" . "―")
				 (":PROPERTIES:" . "")
				 (":END:" . "―")
				 ("#+STARTUP:" . "")
				 ("#+TITLE: " . "")
				 ("#+RESULTS:" . "")
				 ("#+NAME:" . "")
				 ("#+ROAM_TAGS:" . "")
				 ("#+FILETAGS:" . "")
				 ("#+HTML_HEAD:" . "")
				 ("#+SUBTITLE:" . "")
				 ("#+AUTHOR:" . "")
				 (":Effort:" . "")
				 ("SCHEDULED:" . "")
				 ("DEADLINE:" . "")
				 ("lambda" . 955)
				 ))
)

(use-package csharp-mode)

(use-package yaml-mode
  ;; :general
  ;; ('yaml-mode-map "\C-m" 'newline-and-indent)
)

(use-package web-mode)

(use-package vimrc-mode)
;; (add-to-list 'auto-mode-alist '("\\.vim\\(rc\\)?\\'" . vimrc-mode))
