.config/emacs/TANGLE.org
*** LSP
Client for Language Server Protocol \\
https://github.com/emacs-lsp/lsp-mode

#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :preface
  (defun +/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))) ;; Configure orderless
          ;; '(flex) ;; Configure flex (built-in)
  :hook
  ((
    mhtml-mode
    css-mode
    js-mode  ; ts-ls
    ;; c++-mode
    ;; sh-mode
    ;; python-mode
    gdscript-mode
  ) . lsp-deferred)
  (lsp-completion-mode . +/lsp-mode-setup-completion)
  (lsp-mode . lsp-enable-which-key-integration)  ; Which-key integration
  :custom
  (lsp-completion-provider :none) ; we use corfu!
  (lsp-keymap-prefix "C-c l")
;;   (lsp-modeline-diagnostics-scope :workspace)
;;   (lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
;;   (lsp-modeline-code-actions-segments '(count icon name))
  :config
  (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point)))
;;   (lsp-headerline-breadcrumb-mode 1)
;;   (lsp-modeline-code-actions-mode 1)
  ;; :general
  ;; (leader-def :keymaps 'lsp-mode-map
    ;; "l" '(:ignore t :which-key "lsp")
  ;; )
)
#+end_src

**** UI

#+begin_src emacs-lisp
(use-package lsp-ui
  :after lsp-mode
  :commands lsp-ui-mode
  :custom
  (lsp-ui-sideline-mode 1)
  ; Sideline
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-sideline-show-code-actions t)
  (lsp-ui-sideline-update-mode #'point)
  (lsp-ui-sideline-delay 0.6)
  ; Peek
  (lsp-ui-peek-enable t)
  (lsp-ui-peek-show-directory t)
  ; Doc
  (lsp-ui-doc-enable t)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-delay 6.0)
  (lsp-ui-doc-show-with-cursor t)
  (lsp-ui-doc-show-with-mouse t)
  ; Imenu
  (lsp-ui-imenu-window-width 16)
  (lsp-ui-imenu--custom-mode-line-format nil)
  (lsp-ui-imenu-auto-refresh nil)
  (lsp-ui-imenu-refresh-delay nil)
  ;; :general
  ;; (:keymaps 'lsp-ui-mode-map
  ;;   "l p" '(:ignore t :which-key "peek")
  ;;   "l p d" #'(lsp-ui-peek-find-definitions :wk "definition")
  ;;   "l p r" #'(lsp-ui-peek-find-references :wk "reference")
  ;;   "l p w" #'(lsp-ui-peek-find-workspace-symbol :wk "workspace symbol")
  ;;   "l p i" #'(lsp-ui-peek-find-implementation :wk "implementation")
  ;;   "l p b" #'(lsp-ui-peek-jump-backward :wk "jump backward")
  ;;   "l p f" #'(lsp-ui-peek-jump-forward :wk "jump forward")
  ;; )
)
#+end_src

*** Projectile

#+begin_src emacs-lisp
(use-package projectile
  :demand
  :custom
  (projectile-discover-projects-in-search-path t)
  (projectile-project-search-path
   '("/mnt/files/Ricardo/Projects"))
  :config
  (projectile-register-project-type 'godot '("project.godot")
                                    :project-file "project.godot"
				    :compile "godot --help"
				    :test "godot --help"
				    :run "godot --help")
  :general
  (leader-def
    "p" '(projectile-command-map :which-key "project")
    "p" '(:ignore t :which-key "project")
    "p f" '(projectile-find-file :which-key "file")
    "p d" '(projectile-find-dir :which-key "directory")
    "p k" '(projectile-kill-buffers :which-key "kill buffers")
  )
)
#+end_src

*** COMMENT Project

#+begin_src emacs-lisp
(use-package project
  :demand
  :custom
  ;; (projectile-discover-projects-in-search-path t)
  ;; (projectile-project-search-path
   ;; '("/mnt/files/Ricardo/Projects"))
  :general
  (leader-def
    "p" '(:ignore t :which-key "project")
    "p f" '(project-find-file :which-key "file")
    "p d" '(project-find-dir :which-key "directory")
    "p k" '(project-kill-buffers :which-key "kill buffers")
))

(project-current)
#+end_src

* Applications
Applications written in Emacs.

** COMMENT Package
Manager for Emacs Lisp packages.

#+begin_src emacs-lisp :tangle no :noweb-ref package
(require 'package)

; An alist of archives from which to fetch
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
						 ("melpa-stable" . "https://stable.melpa.org/packages/")
						 ("org" . "https://orgmode.org/elpa/")
						 ("elpa" . "https://elpa.gnu.org/packages/")))

; An alist of packages that are pinned to specific archives
;(setq package-archives 'package-pinned-packages '(org . "org"))

; Make installed packages available when Emacs starts
(package-initialize)

; Ensure that Emacs has fetched the package list
(unless package-archive-contents (package-refresh-contents))
#+end_src

*** COMMENT Auto Package Update
Automatically update Emacs packages. (only for package.el)
https://github.com/rranelli/auto-package-update.el

#+begin_src emacs-lisp
(use-package auto-package-update
  :hook (after-init . auto-package-update-minor-mode)
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-delete-old-versions t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src

** Straight
Next-generation, purely functional package manager for the Emacs hacker.
https://github.com/raxod502/straight.el

#+begin_src emacs-lisp :tangle no :noweb-ref straight
; Install straight if not installed
(defvar bootstrap-version)
(let ((bootstrap-file
	   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	  (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
	(with-current-buffer
		(url-retrieve-synchronously
		 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
		 'silent 'inhibit-cookies)
	  (goto-char (point-max))
	  (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src

** Use Package
A use-package declaration for simplifying your ‘.emacs’.
https://github.com/jwiegley/use-package

#+begin_src emacs-lisp :tangle no :noweb-ref use-package
; Use package.el
;(unless (package-installed-p 'use-package)
;  (package-install 'use-package))
;(eval-when-compile
;  (require 'use-package))

; Use straight.el
(straight-use-package 'use-package)
(setq straight-enable-use-package-integration t)
(setq straight-use-package-by-default t)

(setq use-package-always-defer t  
	  use-package-always-pin t
	  use-package-always-ensure nil
	  use-package-verbose nil)
#+end_src

** COMMENT Dashboard
An extensible emacs startup screen showing you what’s most important
https://github.com/emacs-dashboard/emacs-dashboard

#+begin_src emacs-lisp
(use-package dashboard
  :hook (after-init . dashboard-refresh-buffer)
  :custom
  (dashboard-banner-logo-title "Welcome to Emacs!")
  (dashboard-center-content t)
  (dashboard-set-file-icons t)
  (dashboard-set-heading-icons t)
  (dashboard-show-shortcuts t)
  (dashboard-startup-banner 'logo)
  ;; (dashboard-startup-banner (expand-file-name "banner.txt" user-emacs-directory))
  (dashboard-items '((recents  . 5)
					 (bookmarks . 5)
					 (projects . 5)
					 ;; (agenda . 5)  ; This load org package
					 (registers . 5)))
  (dashboard-set-navigator t)
  (dashboard-navigator-buttons
   `(((,(all-the-icons-octicon "mark-github" :height 1.1 :v-adjust 0.0)
	   "GitHub" "rgomezgerardi"
	   (lambda (&rest _) (browse-url "https://github.com/rgomezgerardi")))
	  (,(all-the-icons-faicon "linkedin" :height 1.1 :v-adjust 0.0)
	   "LinkedIn" "rgomezgerardi"
	   (lambda (&rest _) (browse-url "https://linkedin.com"))))))
  (dashboard-set-init-info t)
  (dashboard-init-info (+/display-startup-time))
  (dashboard-set-footer t)
  (dashboard-footer-messages
   '("Dashboard is pretty cool!"
	 "The one true editor, Emacs!"
	 "Who the hell uses VIM anyway? Go Evil!"
	 "Free as free speech, free as free Beer"
	 "Happy coding!"
	 "Vi Vi Vi, the editor of the beast"
	 "Go make yourself some friends, or you'll be lonely"
	 "Welcome to the church of Emacs"
	 "While any text editor can save your files, only Emacs can save your soul"
	 "What the fuck are you doing?"))
  :config
  (if (daemonp)  ; Ensure emacsclient opens on *dashboard* rather than *scratch*
	  (setq initial-buffer-choice  
			(lambda () (get-buffer "*dashboard*")))))
#+end_src

** COMMENT Calendar
Calendar and time management support.

*** Holidays
Holidays support in calendar.

;; (setq holiday-other-holidays
;;       '((holiday-fixed 1 1 "Año nuevo")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 1 year 6) "Día de Reyes")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 3 year 19) "Día de San José")
;; 	(holiday-easter-etc -3 "Jueves Santo")
;; 	(holiday-easter-etc -2 "Viernes Santo")
;; 	(holiday-fixed 5 1 "Día del trabajo")
;; 	(holiday-easter-etc +43 "Día de la ascención")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 6 year 29)
;; 		      "San Pedro y San Pablo")
;; 	(holiday-easter-etc +64 "Corpus Christi")
;; 	(holiday-easter-etc +71 "Sagrado corazón")
;; 	(holiday-fixed 7 20 "Día de la independencia")
;; 	(holiday-fixed 8 7 "Batalla de Boyacá")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 8 year 15)
;; 		      "Asunción de la virgen")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 10 year 12) "Día de la raza")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 11 year 1)
;; 		      "Todos los santos")
;; 	(holiday-sexp '(calendar-nth-named-day 1 1 11 year 11)
;; 		      "Independencia de Cartagena")
;; 	(holiday-fixed 12 25 "Navidad")
;; 	(holiday-fixed 12 8 "Inmaculada concepción")))

** COMMENT Desktop

#+begin_src emacs-lisp
(use-package desktop :straight (:type built-in)
  :demand
  :config
  (desktop-save-mode 1)
  ;; (desktop-revert)

  (setq desktop-buffers-not-to-save
        (concat "\\("
                "^nn\\.a[0-9]+\\|\\.log\\|(ftp)\\|^tags\\|^TAGS"
                "\\|\\.emacs.*\\|\\.diary\\|\\.newsrc-dribble\\|\\.bbdb"
	        "\\)$"))
  (add-to-list 'desktop-modes-not-to-save 'dired-mode)
  (add-to-list 'desktop-modes-not-to-save 'Info-mode)
  (add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
  (add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
)
#+end_src
   
** Emacs

#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete)
  :general
  (leader-def
    "e r" #'((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "reload emacs config")
    "e k" #'(kill-emacs :wk "kill emacs")
  )
)
#+end_src

** Notification
*** Alert
A Growl-workalike for Emacs which uses a common notification interface and multiple, selectable "styles".
https://github.com/jwiegley/alert

#+begin_src emacs-lisp
(use-package alert
:demand
:custom
(alert-default-style 'libnotify)
(alert-fade-time 10)
;; :config
;; (alert-add-rule :status   '(buried visible idle)
                ;; :severity '(moderate high urgent)
                ;; :mode     'evil-smartparens-mode
                ;; :style 'ignore
                ;; :continue t)
)
#+end_src

