.config/emacs/init.el

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :preface
  (defun +/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))) ;; Configure orderless
          ;; '(flex) ;; Configure flex (built-in)
  :hook
  ((
    mhtml-mode
    css-mode
    js-mode  ; ts-ls
    ;; c++-mode
    ;; sh-mode
    ;; python-mode
    gdscript-mode
  ) . lsp-deferred)
  (lsp-completion-mode . +/lsp-mode-setup-completion)
  (lsp-mode . lsp-enable-which-key-integration)  ; Which-key integration
  :custom
  (lsp-completion-provider :none) ; we use corfu!
  (lsp-keymap-prefix "C-c l")
;;   (lsp-modeline-diagnostics-scope :workspace)
;;   (lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
;;   (lsp-modeline-code-actions-segments '(count icon name))
  :config
  (setq-local completion-at-point-functions (list (cape-capf-buster #'lsp-completion-at-point)))
;;   (lsp-headerline-breadcrumb-mode 1)
;;   (lsp-modeline-code-actions-mode 1)
  ;; :general
  ;; (leader-def :keymaps 'lsp-mode-map
    ;; "l" '(:ignore t :which-key "lsp")
  ;; )
)

(use-package lsp-ui
  :after lsp-mode
  :commands lsp-ui-mode
  :custom
  (lsp-ui-sideline-mode 1)
  ; Sideline
  (lsp-ui-sideline-show-diagnostics t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-sideline-show-code-actions t)
  (lsp-ui-sideline-update-mode #'point)
  (lsp-ui-sideline-delay 0.6)
  ; Peek
  (lsp-ui-peek-enable t)
  (lsp-ui-peek-show-directory t)
  ; Doc
  (lsp-ui-doc-enable t)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-delay 6.0)
  (lsp-ui-doc-show-with-cursor t)
  (lsp-ui-doc-show-with-mouse t)
  ; Imenu
  (lsp-ui-imenu-window-width 16)
  (lsp-ui-imenu--custom-mode-line-format nil)
  (lsp-ui-imenu-auto-refresh nil)
  (lsp-ui-imenu-refresh-delay nil)
  ;; :general
  ;; (:keymaps 'lsp-ui-mode-map
  ;;   "l p" '(:ignore t :which-key "peek")
  ;;   "l p d" #'(lsp-ui-peek-find-definitions :wk "definition")
  ;;   "l p r" #'(lsp-ui-peek-find-references :wk "reference")
  ;;   "l p w" #'(lsp-ui-peek-find-workspace-symbol :wk "workspace symbol")
  ;;   "l p i" #'(lsp-ui-peek-find-implementation :wk "implementation")
  ;;   "l p b" #'(lsp-ui-peek-jump-backward :wk "jump backward")
  ;;   "l p f" #'(lsp-ui-peek-jump-forward :wk "jump forward")
  ;; )
)

(use-package projectile
  :demand
  :custom
  (projectile-discover-projects-in-search-path t)
  (projectile-project-search-path
   '("/mnt/files/Ricardo/Projects"))
  :config
  (projectile-register-project-type 'godot '("project.godot")
                                    :project-file "project.godot"
				    :compile "godot --help"
				    :test "godot --help"
				    :run "godot --help")
  :general
  (leader-def
    "p" '(projectile-command-map :which-key "project")
    "p" '(:ignore t :which-key "project")
    "p f" '(projectile-find-file :which-key "file")
    "p d" '(projectile-find-dir :which-key "directory")
    "p k" '(projectile-kill-buffers :which-key "kill buffers")
  )
)

(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete)
  :general
  (leader-def
    "e r" #'((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "reload emacs config")
    "e k" #'(kill-emacs :wk "kill emacs")
  )
)

(use-package alert
:demand
:custom
(alert-default-style 'libnotify)
(alert-fade-time 10)
;; :config
;; (alert-add-rule :status   '(buried visible idle)
                ;; :severity '(moderate high urgent)
                ;; :mode     'evil-smartparens-mode
                ;; :style 'ignore
                ;; :continue t)
)
