.config/emacs/TANGLE.org
*** Wild Notifier
A package which adds notification support for org-agenda views.
With this package you’ll get notifications for TODO entries.
https://github.com/akhramov/org-wild-notifier.el

#+begin_src emacs-lisp
(use-package org-wild-notifier
:after org-mode
:demand
:custom
(org-wild-notifier-alert-time '(1))
(org-wild-notifier-notification-title "Agenda")
(org-wild-notifier-notification-icon nil)
(org-wild-notifier-keyword-whitelist '("TODO"))
(org-wild-notifier-keyword-blacklist nil)
(org-wild-notifier-tags-whitelist nil)
(org-wild-notifier-tags-blacklist nil)
(org-wild-notifier-alert-times-property	"WILD_NOTIFIER_NOTIFY_BEFORE")
:config
(org-wild-notifier-mode 1))
#+end_src

*** COMMENT Org Alert

#+begin_src emacs-lisp
(use-package org-alert
  :demand
  :custom
  (org-alert-interval 300)
  (org-alert-notification-title "*org*")
  (org-alert-notify-cutoff 1)
  :config
  (org-alert-enable))
#+end_src

* Development
Support for further development of Emacs.

** Internal
Code for Emacs internals, build process, defaults.

*** Storage Allocation
Storage allocation and gc for GNU Emacs Lisp interpreter.

**** Garbage Collector Magic Hack (GCMH)
Enforce a sneaky Garbage Collection strategy to minimize GC interference with user activity
https://gitlab.com/koral/gcmh

#+begin_src emacs-lisp :tangle no :noweb-ref gcmh
(use-package gcmh
  :demand
  :custom
  (garbage-collection-messages nil)
  (gcmh-verbose nil)
  ;(gcmh-high-cons-threshold)
  ;(gc-cons-threshold (* 50 1000 1000))  ; The default is 800 kilobytes
  ;(gc-cons-threshold (* 2 1000 1000))  ; Make gc pauses faster by decreasing the threshold
  :config ())  ; Show message if verbose is activated
#+end_src

* Environment
Fitting Emacs with its environment.

** Display
How characters are displayed in buffers.

*** Line Numbers
Display line numbers in the buffer.

#+begin_src emacs-lisp
(use-package display-line-numbers :straight (:type built-in)
  :hook ((prog-mode conf-mode) . display-line-numbers-mode)
  :config ())  ; Show message if verbose is activated




; Disable line numbers for some modes
;; (defcustom display-line-numbers-exempt-modes
;;   '(vterm-mode eshell-mode shell-mode term-mode ansi-term-mode)
;;   "Major modes on which to disable line numbers."
;;   :group 'display-line-numbers
;;   :type 'list
;;   :version "green")

;; (defun display-line-numbers--turn-on ()
;;   "Turn on line numbers except for certain major modes.
;; Exempt major modes are defined in `display-line-numbers-exempt-modes'."
;;   (unless (or (minibufferp)
;;               (member major-mode display-line-numbers-exempt-modes))
;;     (display-line-numbers-mode)))

;; (global-display-line-numbers-mode)






;; (dolist (mode '(term-mode-hook
;; 		dashboard-mode-hook
;; 		org-mode-hook
;; 		treemacs-mode-hook
;; 		eshell-mode-hook))
;;   (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Exec Path from Shell
Make Emacs use shell-defined such as $PATH etc.
https://github.com/purcell/exec-path-from-shell

#+begin_src emacs-lisp :tangle no :noweb-ref exec-path-from-shell
(use-package exec-path-from-shell
  :demand
  :custom
  (exec-path-from-shell-arguments '("-l"))
  :config
  ;  gnu/linux Linux |  windows-nt Windows | darwin macOS
  (when (memq system-type '(gnu/linux darwin))
	(exec-path-from-shell-initialize)))
#+end_src

** Frames
Support for Emacs frames and window systems.

#+begin_src emacs-lisp :tangle early-init.el
(menu-bar-mode 0)
(scroll-bar-mode 0)
(tool-bar-mode 0)
#+end_src

*** COMMENT Fringe
Window fringes.


#+begin_src emacs-lisp :tangle early-init.el
  ; Default appearance of fringes on all frames.
  (setq set-fringe-mode 10)        ; Give some breathing room
#+end_src
   
** Initialization
Emacs start-up procedure.

#+begin_src emacs-lisp :tangle early-init.el
(setq 
inhibit-startup-message t
inhibit-startup-echo-area-message t
inhibit-startup-screen t
user-emacs-directory-warning t
initial-buffer-choice (lambda () (get-buffer "*Messages*"))  ; Buffer to show after starting Emacs
)

; Disable startup echo area message
(fset 'display-startup-echo-area-message 'ignore)
#+end_src

** Menu
Input from the menus.

#+begin_src emacs-lisp
; Don't pop up UI dialogs when prompting
(setq use-dialog-box nil)
#+end_src

** Minibuffer
Controlling the behavior of the minibuffer.

*** Vertico
VERTical Interactive COmpletion.
https://github.com/minad/vertico

#+begin_src emacs-lisp
(use-package vertico
  :demand
  :preface
  (defun +/vertico-backward-updir ()
	"Delete char before or go up directory for file cagetory vertico buffers."
	(interactive)
	(let ((metadata (completion-metadata (minibuffer-contents)
   										 minibuffer-completion-table
   										 minibuffer-completion-predicate)))
	  (if (and (eq (char-before) ?/)
   			   (eq (completion-metadata-get metadata 'category) 'file))
   		  (let ((new-path (minibuffer-contents)))
   			(delete-region (minibuffer-prompt-end) (point-max))
   			(insert (abbreviate-file-name
   					 (file-name-directory
   					  (directory-file-name
   					   (expand-file-name new-path))))))
   		(call-interactively 'backward-delete-char))))
  :custom
  (vertico-count 16)
  (vertico-cycle t)  ; Optionally enable cycling for `vertico-next' and `vertico-previous'
  (vertico-resize nil)  ; Grow and shrink the Vertico minibuffer
  ;; (enable-recursive-minibuffers t)  ; Enable recursive minibuffers
  :config
  (vertico-mode 1)
  ;; (setq minibuffer-prompt-properties  ; Do not allow the cursor in the minibuffer prompt
  ;; 		'(read-only t cursor-intangible t face minibuffer-prompt))
  ;; (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  :general
  (vertico-map
   "M-j" #'vertico-next
   "M-S-j" #'vertico-next-group
   "M-k" #'vertico-previous
   "M-S-k" #'vertico-previous-group
   "M-RET" #'vertico-exit-input
   "<backspace>" #'+/vertico-backward-updir)
  (minibuffer-local-map
   "M-h" #'backward-kill-word))
#+end_src

*** Consult
Practical commands based on the Emacs completion function completing-read.
https://github.com/minad/consult

#+begin_src emacs-lisp
(use-package consult
  :config
  ; Optionally configure a function which returns the project root directory.
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-root-function #'projectile-project-root)
  :general
  (leader-def
    ":" 'consult-complex-command
    "@" 'consult-register
    "#" 'consult-register-load
    "'" 'consult-register-store
    
    "c h" 'consult-history
    "c m" 'consult-mode-command
    "c b" 'consult-bookmark
    "c k" 'consult-kmacro

    "SPC" '(consult-buffer :which-key "Switch to buffer")
    "b w" '(consult-buffer-other-window :which-key "Switch to buffer other window")
    "b f" '(consult-buffer-other-frame :which-key "Switch to buffer other frame")

    "g l" 'consult-goto-line
    "g e" 'consult-compile-error
    "g f" 'consult-flymake  ;; Alternative: consult-flycheck
    "g o" 'consult-outline
    "g m" 'consult-mark
    "g k" 'consult-global-mark
    "g i" 'consult-imenu
    "g I" 'consult-imenu-multi

    "f r" '(consult-recent-file :wk "recent-file")

    "s f" 'consult-find
    "s F" 'consult-locate
    "s g" 'consult-grep
    "s G" 'consult-git-grep
    "s r" 'consult-ripgrep
    "s l" 'consult-line
    "s L" 'consult-line-multi
    "s m" 'consult-multi-occur
    "s k" 'consult-keep-lines
    "s u" 'consult-focus-lines
	"s e" 'consult-isearch))
#+end_src

**** COMMENT Consult LSP
Let’s try to mimic a few features of helm-lsp and lsp-ivy in consult workflow.
https://github.com/gagbo/consult-lsp

#+begin_src emacs-lisp
(use-package consult-lsp
  :config
  (define-key lsp-mode-map [remap xref-find-apropos] #'consult-lsp-symbols))
#+end_src

*** Marginalia
Enrich existing commands with completion annotations.
https://github.com/minad/marginalia

#+begin_src emacs-lisp
(use-package marginalia
  :demand
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :general
  (minibuffer-local-map
   "M-a" #'marginalia-cycle)
  :config
  (marginalia-mode 1))
#+end_src

