.config/emacs/init.el

(use-package org-wild-notifier
:after org-mode
:demand
:custom
(org-wild-notifier-alert-time '(1))
(org-wild-notifier-notification-title "Agenda")
(org-wild-notifier-notification-icon nil)
(org-wild-notifier-keyword-whitelist '("TODO"))
(org-wild-notifier-keyword-blacklist nil)
(org-wild-notifier-tags-whitelist nil)
(org-wild-notifier-tags-blacklist nil)
(org-wild-notifier-alert-times-property	"WILD_NOTIFIER_NOTIFY_BEFORE")
:config
(org-wild-notifier-mode 1))

(use-package display-line-numbers :straight (:type built-in)
  :hook ((prog-mode conf-mode) . display-line-numbers-mode)
  :config ())  ; Show message if verbose is activated




; Disable line numbers for some modes
;; (defcustom display-line-numbers-exempt-modes
;;   '(vterm-mode eshell-mode shell-mode term-mode ansi-term-mode)
;;   "Major modes on which to disable line numbers."
;;   :group 'display-line-numbers
;;   :type 'list
;;   :version "green")

;; (defun display-line-numbers--turn-on ()
;;   "Turn on line numbers except for certain major modes.
;; Exempt major modes are defined in `display-line-numbers-exempt-modes'."
;;   (unless (or (minibufferp)
;;               (member major-mode display-line-numbers-exempt-modes))
;;     (display-line-numbers-mode)))

;; (global-display-line-numbers-mode)






;; (dolist (mode '(term-mode-hook
;; 		dashboard-mode-hook
;; 		org-mode-hook
;; 		treemacs-mode-hook
;; 		eshell-mode-hook))
;;   (add-hook mode (lambda () (display-line-numbers-mode 0))))

; Don't pop up UI dialogs when prompting
(setq use-dialog-box nil)

(use-package vertico
  :demand
  :preface
  (defun +/vertico-backward-updir ()
	"Delete char before or go up directory for file cagetory vertico buffers."
	(interactive)
	(let ((metadata (completion-metadata (minibuffer-contents)
   										 minibuffer-completion-table
   										 minibuffer-completion-predicate)))
	  (if (and (eq (char-before) ?/)
   			   (eq (completion-metadata-get metadata 'category) 'file))
   		  (let ((new-path (minibuffer-contents)))
   			(delete-region (minibuffer-prompt-end) (point-max))
   			(insert (abbreviate-file-name
   					 (file-name-directory
   					  (directory-file-name
   					   (expand-file-name new-path))))))
   		(call-interactively 'backward-delete-char))))
  :custom
  (vertico-count 16)
  (vertico-cycle t)  ; Optionally enable cycling for `vertico-next' and `vertico-previous'
  (vertico-resize nil)  ; Grow and shrink the Vertico minibuffer
  ;; (enable-recursive-minibuffers t)  ; Enable recursive minibuffers
  :config
  (vertico-mode 1)
  ;; (setq minibuffer-prompt-properties  ; Do not allow the cursor in the minibuffer prompt
  ;; 		'(read-only t cursor-intangible t face minibuffer-prompt))
  ;; (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  :general
  (vertico-map
   "M-j" #'vertico-next
   "M-S-j" #'vertico-next-group
   "M-k" #'vertico-previous
   "M-S-k" #'vertico-previous-group
   "M-RET" #'vertico-exit-input
   "<backspace>" #'+/vertico-backward-updir)
  (minibuffer-local-map
   "M-h" #'backward-kill-word))

(use-package consult
  :config
  ; Optionally configure a function which returns the project root directory.
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setq consult-project-root-function #'projectile-project-root)
  :general
  (leader-def
    ":" 'consult-complex-command
    "@" 'consult-register
    "#" 'consult-register-load
    "'" 'consult-register-store
    
    "c h" 'consult-history
    "c m" 'consult-mode-command
    "c b" 'consult-bookmark
    "c k" 'consult-kmacro

    "SPC" '(consult-buffer :which-key "Switch to buffer")
    "b w" '(consult-buffer-other-window :which-key "Switch to buffer other window")
    "b f" '(consult-buffer-other-frame :which-key "Switch to buffer other frame")

    "g l" 'consult-goto-line
    "g e" 'consult-compile-error
    "g f" 'consult-flymake  ;; Alternative: consult-flycheck
    "g o" 'consult-outline
    "g m" 'consult-mark
    "g k" 'consult-global-mark
    "g i" 'consult-imenu
    "g I" 'consult-imenu-multi

    "f r" '(consult-recent-file :wk "recent-file")

    "s f" 'consult-find
    "s F" 'consult-locate
    "s g" 'consult-grep
    "s G" 'consult-git-grep
    "s r" 'consult-ripgrep
    "s l" 'consult-line
    "s L" 'consult-line-multi
    "s m" 'consult-multi-occur
    "s k" 'consult-keep-lines
    "s u" 'consult-focus-lines
	"s e" 'consult-isearch))

(use-package marginalia
  :demand
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :general
  (minibuffer-local-map
   "M-a" #'marginalia-cycle)
  :config
  (marginalia-mode 1))
