.config/emacs/TANGLE.org
*** Orderless
Completion method that matches space-separated regexps in any order.
https://github.com/oantolin/orderless

#+begin_src emacs-lisp
(use-package orderless
  :demand
  :custom
  (completion-styles '(orderless))
  ;; (orderless-component-separator "[ &]")
  ;; (orderless-component-separator "[ +]")
  ;; (completion-category-defaults nil)
  ;; (completion-category-overrides '((file (styles . (orderless partial-completion)))))
  :config
  ;; ...otherwise find-file gets different highlighting than other commands
  ;; (set-face-attribute 'completions-first-difference nil :inherit nil)

  ;; (setq orderless-style-dispatchers
  ;; 	'(lambda (pattern _index _total) 
  ;; 	   (cond
  ;; 	    Ensure $ works with Consult commands, which add disambiguation suffixes
  ;; 	    ((string-suffix-p "$" pattern)
  ;; 	     `(orderless-regexp . ,(concat (substring pattern 0 -1) "[\x100000-\x10FFFD]*$")))
  ;; 	    ;; Ignore single !
  ;; 	    ((string= "!" pattern) `(orderless-literal . ""))
  ;; 	    ;; Without literal
  ;; 	    ((string-prefix-p "!" pattern) `(orderless-without-literal . ,(substring pattern 1)))
  ;; 	    ;; Initialism matching
  ;; 	    ((string-prefix-p "`" pattern) `(orderless-initialism . ,(substring pattern 1)))
  ;; 	    ((string-suffix-p "`" pattern) `(orderless-initialism . ,(substring pattern 0 -1)))
  ;; 	    ;; Literal matching
  ;; 	    ((string-prefix-p "=" pattern) `(orderless-literal . ,(substring pattern 1)))
  ;; 	    ((string-suffix-p "=" pattern) `(orderless-literal . ,(substring pattern 0 -1)))
  ;; 	    ;; Flex matching
  ;; 	    ((string-prefix-p "~" pattern) `(orderless-flex . ,(substring pattern 1)))
  ;; 	    ((string-suffix-p "~" pattern) `(orderless-flex . ,(substring pattern 0 -1))))))
)
#+end_src

*** Savehist
Save minibuffer history.

#+begin_src emacs-lisp
(use-package savehist
  :demand
  :config
  (setq history-length 16)
  (savehist-mode 1)
)
#+end_src

*** COMMENT Mini Frame
Place minibuffer at the top of the current frame on read-from-minibuffer.
https://github.com/muffinmad/emacs-mini-frame

#+begin_src emacs-lisp :tangle no
(use-package mini-frame
  :hook (after-init . mini-frame-mode)
  :custom
  (mini-frame-show-parameters
   '((top . 50)
     (width . 0.7)
     (left . 0.5)))
  (mini-frame-ignore-commands
   '(eval-expression
	 "edebug-eval-expression"
	 debugger-eval-expression
	 evil-ex
	 "consult"))
  :config ())  ; Show message if verbose is activated
#+end_src

*** COMMENT Ibuffer

"b i"   '(ibuffer :which-key "Ibuffer")
"b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")

** Mode Line
Contents of the mode line.

*** Doom Modeline
A fancy and fast mode-line inspired by minimalism design.
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :after doom-themes
  :demand
  :custom
  (column-number-mode t)
  (inhibit-compacting-font-caches t)
  (doom-modeline-height 16)  ; How tall the mode-line should be
  (doom-modeline-icon t)  ; Whether display icons in the mode-line
  (doom-modeline-indent-info nil)  ; Whether display the indentation information
  :config
  (doom-modeline-mode 1))
#+end_src
   
* Faces
Support for multiple fonts.

** COMMENT Basic Faces
The standard faces of Emacs.

#+begin_src emacs-lisp
(defun +/set-font-faces ()
  ;; (set-face-attribute 'default nil
		  ;; :font "Ubuntu"
		  ;; :weight 'normal
		  ;; :height 120)

  (set-face-attribute 'fixed-pitch nil
		  ;:family "Monospace"
		  :font "Ubuntu"
		  ;:weight 'light
		  :height 120))

  ;; (set-face-attribute 'variable-pitch nil
		  ;:family "Monospace"
		  ;; :font "Symbols Nerd Font"
		  ;:weight 'light
		  ;; :height 120
		  ;; ))

;; This is needed for the deamon (emacsclient)
(if (daemonp)
	  (add-hook 'after-make-frame-functions ; (Emacs < 27)
	  ;; (add-hook 'server-after-make-frame-hook)
		(lambda (frame)
		  (with-selected-frame frame
			(+/set-font-faces))))
	  (+/set-font-faces))
#+end_src

** Doom Themes
Options for doom-themes.
https://github.com/hlissner/emacs-doom-themes

#+begin_src emacs-lisp :tangle no :noweb-ref doom-themes
(use-package doom-themes
  :demand
  :custom
  ;; (doom-theme 'doom-one)  ; This is for highlight indent guide
  (doom-themes-enable-bold t)  ; If nil, bold will be disabled across all faces
  (doom-themes-enable-italic t)  ; If nil, italics will be disabled across all faces
  (doom-themes-padded-modeline nil)  ; Default value for padded-modeline setting for themes that support it
  (doom-themes-treemacs-theme "doom-atom")
  :config
  (load-theme 'doom-one t)
  (doom-themes-visual-bell-config)  ; Enable flashing the mode-line on error
  (doom-themes-treemacs-config)  ; Install doom-themes' treemacs configuration
  (doom-themes-org-config))  ; Corrects (and improves) org-mode's native fontification

; Alist of default values for frame creation
;; (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
	;; (add-to-list 'default-frame-alist '(alpha . (100 . 100)))
#+end_src

** Solaired
If only certain buffers could be so grossly incandescent.
https://github.com/hlissner/emacs-solaire-mode

#+begin_src emacs-lisp
(use-package solaire-mode
  :demand
  ;; :hook
  ;; ((change-major-mode after-revert ediff-prepare-buffer) . turn-on-solaire-mode)
  ;; (minibuffer-setup . solaire-mode-fix-minibuffer)
;;   ((messages-buffer-mode dashboard-mode lisp-interaction-mode) . (lambda () (solaire-mode 0)))
  :config
  (solaire-global-mode 1)
  ;; (add-hook 'after-make-frame-functions
  ;;           (lambda (_frame)
  ;;             (load-theme 'doom-one t)
  ;;             (solaire-mode-swap-bg)))
)
#+end_src

** COMMENT All the Icons
A library for inserting Developer icons
https://github.com/domtronn/all-the-icons.el

#+begin_src emacs-lisp
(use-package all-the-icons
  :demand
  :if (display-graphic-p)
  :config ())  ; Show message if verbose is activated
#+end_src
   
** Highlight Indent Guides
Minor mode to highlight indentation
https://github.com/DarthFennec/highlight-indent-guides

#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook ((prog-mode conf-mode org-mode) . highlight-indent-guides-mode)
  :custom
  (highlight-indent-guides-suppress-auto-error t)
  (highlight-indent-guides-character 9474)  ; | 124  ⇥ 8677  ⇨ 8680  ↦ 8614 default 9474
  (highlight-indent-guides-method 'character)  ; Method to use when displaying indent guides
  (highlight-indent-guides-responsive 'stack)
  (highlight-indent-guides-auto-enabled t)
  )

  ;; :config
  ;; (when doom-theme
    ;; (+/indent-guides-init-faces-h))

  ;; ;; `highlight-indent-guides' breaks when `org-indent-mode' is active
  ;; (+/add-hook 'org-mode-local-vars-hook
  ;;   (defun +indent-guides-disable-maybe-h ()
  ;;     (and highlight-indent-guides-mode
  ;;          (bound-and-true-p org-indent-mode)
  ;;          (highlight-indent-guides-mode -1))))
#+end_src

** COMMENT Ligature
Typographic Ligatures in Emacs.
https://github.com/mickeynp/ligature.el

#+begin_src emacs-lisp
(use-package ligature
  :straight (ligature :type git :host github :repo "mickeynp/ligature.el")
  :ghook ('after-init-hook #'global-ligature-mode)
  :custom
  (ligature-ignored-major-modes '(minibuffer-inactive-mode dashboard-mode))
  (ligature-mode-set-explicitly t)
  :config
  (ligature-set-ligatures 't '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "\\\\"
                               ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                               "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                               "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                               "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                               "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                               "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                               "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                               ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                               "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                               "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "?:" "://"
                               "?=" "?." "??" ";;" "/*" "/=" "/>" "__" "~~" "(*" "*)" "||>"
							   ;; "++" "//"  ; Trouble maker
							   )))
#+end_src
 
** COMMENT Unicode Fonts
Configure Unicode fonts
http://github.com/rolandwalker/unicode-fonts

#+begin_src emacs-lisp
(setq byte-compile-warnings '(cl-functions))  ; Disable "Package cl is deprecated" message

(use-package unicode-fonts
  :demand
  :config
  (unicode-fonts-setup))
#+end_src

* Help
Support for Emacs help systems.

** Helpful
A better *help* buffer
https://github.com/Wilfred/helpful

#+begin_src emacs-lisp
(use-package helpful
  :general
  (leader-def
    "h" '(:ignore t :which-key "help")
    "h f" #'(helpful-callable :wk "callable")
    "h F" #'(helpful-function :wk "function")
    "h o" #'(helpful-symbol :wk "symbol")
    "h v" #'(helpful-variable :wk "variable")
    "h c" #'(helpful-command :wk "command")
    "h k" #'(helpful-key :wk "key")
    "h i" #'(info :wk "info")
    "h r" #'(info-emacs-manual :wk "emacs manual")
    "h a" #'(consult-apropos :wk "apropos")
    "h s" #'(describe-syntax :wk "syntax")
    "h O" #'((lambda () (interactive) (info "org")) :wk "org manual")
    "h R" #'((lambda () (interactive) (info "elisp")) :wk "elisp manual"))
  :config ())  ; Show message if verbose is activated
#+end_src

** Which Key 
Display available keybindings in popup
https://github.com/justbur/emacs-which-key

#+begin_src emacs-lisp
;; ‘window-setup-hook’ or ‘tty-setup-hook’
(use-package which-key
  :demand
  :custom
  (which-key-idle-delay 0.4)
  :config
  (which-key-mode))
#+end_src

** Customize
Customization of the Customization support.

#+begin_src emacs-lisp
(use-package customize :straight (:type built-in)
  :custom
  (custom-file (locate-user-emacs-file "custom-vars.el"))
  :config
  (load custom-file 'noerror 'nomessage))
#+end_src

* Multimedia
Non-textual support, specifically images and sound.

** Emms

* Local
Code local to your site.

